{
    "Data": [
        {
            "name": "Gail Pinnock",
            "title": "BSc (Hons) Nutrition and Dietetics, RD, MBDA",
            "bio": "A responsible, enthusiastic self-motivated and professional Dietitian with vast experience in assessing a client’s nutritional needs, then developing and implementing nutrition programs suited to their requirements. Possess the ability to communicate complex and sensitive information in a logical and empathetic form. Proven track record of successfully promoting healthy eating habits …\n\nBini Suresh\nRead More »\n\n\nView Details for Bini Suresh"
        },
        {
            "name": "Sian O'Shea",
            "title": "RD MSc",
            "bio": "A seasoned professional with many years experience of guiding people towards better health and wellbeing.  Gut health and IBS management are my main areas of interest and expertise.  I also have a wealth of experience in producing evidence-based nutrition and health related content for wellness organisations and their publications.\n View Details for Tony Hirving"
        },
        {
            "name": "Penny Vlachou",
            "title": "BSc, MSc, PG cert.",
            "bio": "A WorkReady Accredited and highly motivated dietitian, Sarah is keen to work alongside you to improve the health and well-being of your employees. She'll help to empower you all towards better health. Services to your business can include assessing the nutritional environment, helping you work towards workplace health accolades and nutritional presentations tailored to your team.\n View Details for Sarah Lumley"
        },
        {
            "name": "Georgina Giebner",
            "title": "MSc PGDip (Diet) BSc (Hons) PT level 3",
            "bio": "Advanced Practice Dietitian specialising in the nutritonal and dietetic management of  gastrointestinal disease and disorders, liver and pancreatic conditions, and GI symptoms post surgery and cancer therapy.\n View Details for Claire Oldale"
        },
        {
            "name": "Douglas Twenefour",
            "title": "MPhil PG Dip, Registered Dietitian",
            "bio": "Advanced specialist dietitian providing a telehealth service nationally and internationally. My specialist area is cancer from prehabilitation to the late effects from cancer treatment (radiotherapy/chemotherapy/surgery/immunotherapy side effects in the shorter and longer term) plus support in palliative care/symptom management. I can also support a number of other complex areas of dietetics with over 20 years of NHS and freelance experience including rehabilitation from trauma, illness and surgery, gastrointestinal conditions and nutritional support. I also offer personalised nutrition services using the latest nutrigenomics/nutrigenetics approaches alongside dietary intake assessment.\n View Details for Georgina Giebner",
            "url": "https://www.facebook.com/therehabdietitian"
        },
        {
            "name": "Julie Walker",
            "title": "BSc Hons RD",
            "bio": "Aisling (Ash) Pigott (RD) PgCert Sports and Exercise Nutrition, MsC Advanced Practice.  Research and evidence based practitioner. Anti-Fads, Pro-Health\n\nMedia Expert\n*BBCNews, BBCWales, ITVWales, Radio5, Vogue magazine (and more). TV, Radio and Print. \n\nRelationships with food\n*When it comes to weight, there is no one size fits all. Building a healthy relationship with food and self is key to health and wellbeing\n\nSports Nutrition\n* As an ultra-endurance runner, passion for sports nutrition. Ex-Sports Nutrition Lecturer (University of South Wales). Experience with professional and amateur athletes. \n\nEarly Years Nutrition\n*As a first time Mum and Paediatric specialist, Ash is ideally placed to understand evidence based guidance and practical application\n\nFamily Planning\n* Planning a family can be a difficult time. Nutrition plays a key role in conception and pregnancy. Building healthy relationships with food, self and managing weight pre (and during) pregnancies.\n View Details for Aisling Pigott",
            "url": "https://www.facebook.com/dietitianwales"
        },
        {
            "name": "Gillian Killiner",
            "title": "BSc. (Hons) MSc. RD",
            "bio": "Aleeza Rosenberg is a registered dietitian offering evidence-based nutritional services to individuals and corporates. She graduated cum laude with an Honours degree in Dietetics and was awarded the degree ‘MSc Clinical Nutrition (Eating Disorders)’ with distinction from University College London (UCL). She has been practising since 2004 and has extensive …\n\nAleeza Rosenberg\nRead More »\n\n\nView Details for Aleeza Rosenberg"
        },
        {
            "name": "Lucy Pritchard",
            "title": "BSc (Hons) Registered Dietitian",
            "bio": "Alex is a UK registered dietitian working both in the NHS and privately. She has vast experience in many clinical areas (including weight management, diabetes, gastro, fertility and women's health) and is a health writer, recipe developer and runs group education courses.\n View Details for Alex Ballard",
            "url": "https://www.facebook.com/alextalksdiet"
        },
        {
            "name": "Samantha (Sam) Perkins",
            "title": "BSc (Hons) RD,",
            "bio": "Amy is an adult & paediatric dietitian passionate about helping families to find peace at mealtimes by supporting parents & children to build healthy relationships to food.\n View Details for Amy Powderham"
        },
        {
            "name": "Elizabeth Campling",
            "title": "BSc Hons Dietetics",
            "bio": "An experienced dietitian with 15 years experience working in the NHS and a post graduate certificate in advanced professional practice. Interests include; obesity, type 2 diabetes, chronic kidney disease, behaviour change, sustainability, service development and research. Having worked in the NHS for many years I am aware of the challenges facing …\n\nLaura Kyte\nRead More »\n\n\nView Details for Laura Kyte"
        },
        {
            "name": "Bridgette Wilson",
            "title": "BSc, MSc, PGDip, PhD, RD",
            "bio": "An expert in the field of maternal, infant, child and adolescent nutrition, Emily is passionate about improving health through diet.   She has specialised as a Paediatric Dietitian for over 10 years and using her wide breadth of knowledge gained by working at different NHS hospitals, set up Well Child Nutrition …\n\nEmily Sutton\nRead More »\n\n\nView Details for Emily Sutton",
            "url": "https://www.facebook.com/Well-Child-Nutrition-322983835030818/?modal=admin_todo_tour"
        },
        {
            "name": "Menahem Harati",
            "title": "M.A RD",
            "bio": "Ana qualified as a registered Dietitian in 2009, registration number DT25349. Ana is trilingual and is able to carry out dietetic assessments and interventions in English, Spanish and Basque. Ana previously qualified as a Psychologist in Spain where she conducted Cognitive Behavioural Therapy with women suffering from Chronic Fatigue Syndrome …\n\nAna Etxeberria\nRead More »\n\n\nView Details for Ana Etxeberria"
        },
        {
            "name": "Laura Coster",
            "title": "1st Class Bsc. Nutrition & Dietetics (Hons)",
            "bio": "Anna is a highly-skilled registered Dietitian, with specialist areas of gastroenterology ( i.e IBS), weight loss and disordered eating. She also has experience working with the media such as The Telegraph, Guardian and Women’s Health Magazine.  Anna graduated as a Dietitian from Leeds Metropolitan University and has recently completed the …\n\nAnna Hardman\nRead More »\n\n\nView Details for Anna Hardman"
        },
        {
            "name": "Jennifer Low",
            "title": "PGDip Dietetics, MSc Nutrition, BSc Psychology",
            "bio": "Are you looking for a Registered Dietitian that could help you or your business with diet, health and wellbeing matters, group presentations, lecturing and offers 1:1 consultations.\nDawn specialises in Adult food allergy, food sensitivities /intolerances,Coeliac Disease,Gluten sensitivity, Irritable bowel syndrome including the FODMAPS diet ? Dawn has recently established her freelance practice alongside her NHS work with 14 years experience working as as the Lead Specialist Allergy Dietitian  and 20 years experience working in gastroenterology at Newcastle Upon Tyne Hospitals NHS Trust. \nDawn presents at regional healthcare professional study days and has participated in research publication on Coeliac Disease.\nDawn is based in Durham city centre which is easily accessible to people and business in the North East Region UK.\n View Details for Dawn Smith"
        },
        {
            "name": "Amy Powderham",
            "title": "BSc (Hons) Nutrition & Dietetics",
            "bio": "Are you looking for a registered dietitian to assist your organisation with a project; written article; menu or recipe analysis; training staff including within care homes; workplace health promotion or any other relevant piece of work? Then please get in touch after viewing my profile. I have many years of experience in the NHS and am now available for freelance work. Please note I am currently not providing individual consultations.\n View Details for Janet Gordon"
        },
        {
            "name": "Joan Gavin",
            "title": "BSc (Hons) RD MPhil",
            "bio": "Are you looking for an experienced Registered Dietitian for a training event or a particular project? Or an individual suffering with a clinical condition and need some dietary advice? If you are looking for evidence based professional advice then please contact me below or email me at enquiries@eatwellnow.co.uk. I work …\n\nDebra Williams\nRead More »\n\n\nView Details for Debra Williams",
            "url": "https://www.facebook.com/Eat-Well-Now-1538381129731986/?ref=bookmarks"
        },
        {
            "name": "Gillian Farren",
            "title": "BSc (Human Nutrition and Dietetics), Hons Dip (Human Nutrition and Dietetics), MA (Health Promotion), PG Dip (Healthcare Informatics), PG Cert (Diabetes Specialist Care)",
            "bio": "As a dietitian I have worked in primary care settings , private practic and charitable organisations. My area of interest includes weight management, diabetes and CVD.\n View Details for Kirulagini Sivamathavan"
        },
        {
            "name": "Kathy Cowbrough",
            "title": "BHSc, Masters Public Health Nutrition (MPHN)",
            "bio": "As a registered paediatric dietitian it is my passion to help children to eat the best diet possible for their individual needs. I work with babies and children with a variety of nutritional issues including: allergies, faltering growth, fussy eaters, babies starting solids, coeliac disease, constipation, vegetarian & vegan diets …\n\nLucy Neary\nRead More »\n\n\nView Details for Lucy Neary",
            "url": "https://www.facebook.com/theearlyyearsdietitian"
        },
        {
            "name": "Alice Walker",
            "title": "Bsc Hons Nutrition and Dietetics (Surrey University 2009)",
            "bio": "As an experienced Dietitian, David has a history of working in research, community and mental health dietetics. His experience is in forensic mental health, eating disorders, diabetes and obesity and so brings a passion for multiple specialist areas of dietetics. Now working as a Team Lead Dietitian at a leading …\n\nDavid Simms\nRead More »\n\n\nView Details for David Simms"
        },
        {
            "name": "Emma Ferris",
            "title": "Bsc ( 1st degree) Nutrition and Dietetics",
            "bio": "As well as doing freelance work I work part time for the NHS specialising in eating disorders including paediatric ARFID presentations and adult mental health as well as delivering training and developing resources for patients, carers and healthcare professionals.\n View Details for Jo Withers",
            "url": "https://www.facebook.com/Mindful-Menus-movement-1413483625573101/?ref=bookmarks"
        },
        {
            "name": "Gill Ashton",
            "title": "BSc (Honors) RD",
            "bio": "At Care4Nutrition we specialise in providing workplace health and personalised 1- 1 nutrition consultations. Elaine has extensive experience working in the areas of  cardiovascular health (high blood pressure, high cholesterol), COPD, cancer, nutrition support after illness, nutrition in chronic illness and fatigue, neurological conditions such as stroke, MND and MS.  \nMore recently Elaine has been involved in enhancing nutritional status following Covid-19 and working with Long Covid clients. To enquire or book a 1-1 appointment you can: email carefornutrition@gmail.com or call Elaine on 07749450199\n View Details for Elaine Anderson"
        },
        {
            "name": "Katie Psarou",
            "title": "BSc (Hons) Dietetics, MSc Weight Management, PhD Diabetes and Endocrinology",
            "bio": "At The Gut Health Doctor, we’re passionate about driving gut health education and initiatives. Dr Megan Rossi has worked with world-leading companies across the globe to bridge the gap between the science and the consumer offering.\nProviding essential credibility and expertise, Megan acts as a consultant, ambassador and spokesperson for brands not only in food, but across all areas of gut health, spanning fitness, healthcare and lifestyle.\n View Details for Megan Rossi",
            "url": "https://www.facebook.com/theguthealthdoctor/"
        },
        {
            "name": "Natalie Callue",
            "title": "1st class BSc Honours Dietetics",
            "bio": "avisso are an expert team of food consultants, including dietitians, with a wealth of experience, working in a wide range of settings including clinical, corporate, education and the food industry.\n View Details for Tess Warnes"
        },
        {
            "name": "Naomi Ronan",
            "title": "PgDip Human Nutrition and Dietetics BSc (Hons) Nutritional Science",
            "bio": "Azmina is a lively expert nutritionist with over 20 years experience. She has won several professional awards, appeared regularly on television and published 20 books.\nShe specialises in plant-based eating, diabetes, key opinion leader engagement, social media campaigns and nutrition strategy for food brands.\n View Details for Azmina Govindji",
            "url": "https://www.facebook.com/Azmina-Nutrition-124550070944111"
        },
        {
            "name": "Katie Powell",
            "title": "Nutrition & Dietetics BSc (Hons)",
            "bio": "Based in South London (Clapham Junction) Laura started Right Spot Nutrition as she is passionate about helping all members of the public. She works in the NHS Monday- Friday however offers clinic slots in the evening and on the weekends. Together you will come up with a plan to help …\n\nLaura Boyle\nRead More »\n\n\nView Details for Laura Boyle",
            "url": "https://www.facebook.com/rightspotnutrition/"
        },
        {
            "name": "Liesl Silbernagl",
            "title": "BSc (Honours) Nutrition and Dietetics",
            "bio": "Based in the heart of Bishops Stortford we offer one to one online sessions to explore and support you with practical advice to deal with your dietary issues. Face to face sessions will be available in the near future.\n View Details for Julie Walker"
        },
        {
            "name": "Navjt Kaur Sidhu",
            "title": "Nutrition and Dietetics BSc Hons",
            "bio": "Besides providing online consultations for women with PCOS I also offer a range of other services. I work with brands on new product launches and generating new claims, I write content for media, my own and other's blogs and am available for talks, podcast interviews and other public education services.\n View Details for Jodie Relf"
        },
        {
            "name": "Lynda Rigley",
            "title": "Post Graduate Diploma Dietetics RD; PhD in Children's growth and nutrition; Bsc (Hons) Catering Science and Applied Nutrition",
            "bio": "Caroline is an award-winning HCPC registered dietitian with vast experience working for the NHS in community and acute settings and the private sector. Her areas of expertise include weight management, irritable bowel syndrome (IBS) and plant-based diets.\n View Details for Caroline Bletcher"
        },
        {
            "name": "Jeanette Starkey",
            "title": "B.Sc. Hons Dietetics; P. Grad Diploma Allergy",
            "bio": "Caroline studied Nutrition and Dietetics at Kings College London, qualifying with distinction in 1990. Since then she has worked as a Specialist Dietitian in the NHS at a variety of teaching Hospitals including Charing Cross and Westminster, St Marys (Paddington), Newcastle Royal Victoria Infirmary before settling on the South Coast at Royal Sussex County Hospital, Brighton in 2002.  Specialities include Gastroenterology (irritable bowel), Oncology, Malnutrition/ Nutritional Support, Community Development work, Obesity and Bariatrics, Mental Health (including dementia).\n View Details for Caroline Laidlaw"
        },
        {
            "name": "Christine O'Brien",
            "title": "BSc (Honours) Nutrition & Dietetics",
            "bio": "Catherine is an experienced Registered Dietitian specialising in gastroenterology and complex nutrition support. With over 10 years clinical experience.\nCatherine is an active member of the BDA and volunteers as a media spokesperson. Providing evidence-based nutrition to media and has been featured in The Independent, Times, The Stylist, BBC and Women’s Health. \nCatherine has wrote sponsored articles on her areas of expertise in gut health and nutrition support for a number of consumer brands. She is available for brand partnerships and consultancy work including corporate health and wellness.\nCatherine is passionate about teaching and sharing her knowledge on nutrition as well as the importance of diversity in Dietetics. She is available for guest lecturing, expert panels and guest speaking at conferences.\nShe has an active social media presence on Instagram @caffdietitian and regularly shares easy to understand nutrition advice, recipes and wellness.\n View Details for Catherine Rabess",
            "url": "https://facebook.com/caffdietitian"
        },
        {
            "name": "Sarah Brook",
            "title": "BSc (Hons) PGCert",
            "bio": "Chloe is an experienced children's dietitian with expertise in neurology and gastroenterology.\n View Details for Chloe Elliott",
            "url": "https://facebook.com/citydietitians"
        },
        {
            "name": "Jenny Bazely",
            "title": "Msc Advanced Dietetic Practice, Bsc (Hons) Nutrition & Dietetics HCPC Registered Dietitian since June 2006.",
            "bio": "Christine is a Registered anti diet Dietitian & body confidence coach. In her 12 week transformation program she takes from confused and hating your body to happy, confident and in control.\n View Details for Christine Kenny",
            "url": "https://www.facebook.com/ckennynutrition/"
        },
        {
            "name": "Elaine Lane",
            "title": "HCPC Registered Dietitian, BSc Hons Human Nutrition & Dietetics, Masters Healthcare Studies, RNutr, mBDA",
            "bio": "Claire is a BDA Media Spokesperson often working with the media on written articles, social media and consumer press. Claire is a published scientific author who enjoys lecturing and teaching both students and in the corporate environment.\n View Details for Claire Pettitt",
            "url": "https://www.facebook.com/CpNutrition"
        },
        {
            "name": "Emer Delaney",
            "title": "BSc (Hons), RD, BDA, INDI",
            "bio": "Claire is an experienced Dietitian, who graduated from the University of Surrey in 1991 with a first class honours degree in Nutrition and Dietetics. Claire has over 20 years of clinical experience and can offer advice and support for a wide range of medical conditions. She is passionate about the …\n\nClaire Fenlon\nRead More »\n\n\nView Details for Claire Fenlon"
        },
        {
            "name": "Sophie Claessens",
            "title": "RD, BSc (Hons), HCPC, mBDA",
            "bio": "Clare is an experienced Dietitian, she qualified in 2002 and since then has worked within both the NHS and private practice. Clare currently works for Powys Teaching Health Board as a Specialist Eating Disorders (CAMHS) Dietitian and Renal Dietitian. Prior to this post she has worked in both hospital and …\n\nClare Clement\nRead More »\n\n\nView Details for Clare Clement"
        },
        {
            "name": "Ruth Kander",
            "title": "Dietetics Postgraduate",
            "bio": "Claudia is a dedicated Dietitian with a passion for food and teaching and motivating people to lead a healthy life, always taking into account their individual needs and circumstances. She has many years of experience in helping people with the challenges confronted when changing lifestyle and eating behaviour and adapting …\n\nClaudia Ehrlicher\nRead More »\n\n\nView Details for Claudia Ehrlicher"
        },
        {
            "name": "Sophie Medlin",
            "title": "Consultant Dietitian",
            "bio": "Clinical dietitian and high-performance sports nutritionist\nExperience in a wide variety of clinical nutrition including FODMAPs, renal, obesity and bariatrics, diabetes and eating disorders. Experienced sport performance nutritionist and dietitian\nhttps://www.4thdiscipline.co.uk/\n View Details for Claire Fudge"
        },
        {
            "name": "Rania Salman",
            "title": "PgDip Nutrition and dietetics (Merit), BSc (Hons)",
            "bio": "Core Nutrition Specialists Dietitans are available for private consultations.  Alternatively, we can effectively promote health and wellbeing or education or topical group sessions, to individual clients or to the wider public. \nWe are available for work anywhere including the NHS, private clinics, hospitals, sports clubs, businesses, TV, radio, magazines and newspapers. \nPrivate consultations are available on line during the covid-19 pandemic and face to face when restrictions have been lifted.\n View Details for Patricia Castle"
        },
        {
            "name": "Katie Barton",
            "title": "MSc RD",
            "bio": "Currently working with NHS Scotland and as a freelance Dietitian.\n View Details for Lorraine McCreary",
            "url": "http://facebook.comdietscotland/"
        },
        {
            "name": "Helen Turner",
            "title": "BSc (Hons) PG Diploma RD",
            "bio": "Deborah David. Freelance Dietitian - Hampton, Middlesex. UK\n View Details for Deborah David"
        },
        {
            "name": "Chanda Pattni",
            "title": "Degree of Bachelor of Science with Honors in Dietetics",
            "bio": "Deepti Loomba- Bsc (Honors), RD, MBDA, Personal Trainer Deepti is a specialist in weight management, hormone- driven conditions and irritable bowel syndrome. She currently works as a Senior Dietitian and Weight Management Specialist Dietitian in a complex weight loss program where she supports other clinicians in ensuring that we continue …\n\nDeepti Loomba\nRead More »\n\n\nView Details for Deepti Loomba"
        },
        {
            "name": "Niamh Gilligan",
            "title": "BSc Hons in Dietetics, RD, HCPC",
            "bio": "Diabetes Specialist Dietitian\n View Details for Sema Jethwa"
        },
        {
            "name": "Luci Daniels",
            "title": "BSc Hons, Registered Dietitian, Fellow BDA",
            "bio": "Diabetes Specialist Dietitian with skills in communicating science and health messages in a concise and engaging way. Broad experience, including corporate events and policy production.  Please contact me to discuss your requirements.\n View Details for Isabel Hooley",
            "url": "http://www.facebook.com/Hooley.Isabel"
        },
        {
            "name": "Deepti Loomba",
            "title": "Registered Dietitian",
            "bio": "Do you feel overwhelmed with information, but lacking in clarity as to what is right for you and your body? My ethos is to be realistic and down to earth and cut through the confusion so you gain insight, with advice that's tailored to your day to day life. No gimmicks, no fad diets, just an holistic approach, grounded in science, to empower you. How does that sound?\n\nI have nearly 20 years of experience as a registered dietitian, in the NHS, healthcare services abroad, and in the commercial sector which have given me the opportunity to work with thousands of individuals, allowing a unique depth of understanding into the challenges many people face when exploring changes to their diet and lifestyle. My post-graduate training in many aspects, including Behaviour Change Therapy and Intuitive Eating, facilitate us to consider all that influences your food choices, to enable you to develop a much happier, healthier relationship with food.\n\nFree discovery calls are available to book.\n View Details for Laura Clark",
            "url": "https://facebook.com/lauraclarknutrition"
        },
        {
            "name": "Patricia Castle",
            "title": "BSc (Hons) RD",
            "bio": "Dorottya is an experienced dietitian with a specialist interest in complex weight management and in eating disorders. She has considerable clinical experience in working with children and adolescents as well as adults in both these fields and is well suited to provide expertise in supporting clients with multiple physical and mental health complexities. Dorottya's practice aims to create a therapeutic environment and is informed by psychological approaches for sustained behaviour change. She is passionate about empowering her clients to implement realistic and sustainable changes that make a lasting difference for long term well-being.   \n View Details for Dorottya Norton"
        },
        {
            "name": "Helen Bond",
            "title": "State Registered Dietitian - BSc. (Hons) Dietetics SRD, MBDA",
            "bio": "Dr Bridgette Wilson is a gut health clinical and research dietitian working in the NHS and Private Practice as well as conducting clinical research into diet and gut health at King's College London\n View Details for Bridgette Wilson",
            "url": "https://www.facebook.com/realfooddoctor"
        },
        {
            "name": "Rebecca McManamon",
            "title": "Master of Nutrition, Registered Dietitian",
            "bio": "Dr Laura Stewart and AppleTree Healthy Lifestyle Consultancy provides expert consultancy to give companies and organisations sound scientific information to enable them to support their clients and employees to enjoy a healthier lifestyle.\n View Details for Laura Stewart",
            "url": "https://www.facebook.com/DrLauraAppletree/"
        },
        {
            "name": "Reema Patel",
            "title": "BSc Nutrition and Dietetics, MSc Sports and Exercise Nutrition",
            "bio": "Dr Mabel Blades RD, MPhil, MBA is an experienced dietitian registered with the HCPC and member of the British Dietetic Association. Provides expertise to people with dietary issues plus also to organisations  dealing with food and nutrition.\n View Details for Mabel Blades"
        },
        {
            "name": "Alice Johnson",
            "title": "BSc (Hons) PG DIP RD",
            "bio": "Elaine, as a self-employed Dietitian based in West Yorkshire, offer professional food, nutrition and dietetic expertise to; developmental projects requiring a partnership approach to health and well-being, deliver nutrition training and much more...\n View Details for Elaine Lane"
        },
        {
            "name": "Judith Paterson",
            "title": "BSc Nutrition and Dietetics",
            "bio": "Emily Bloxam is a registered dietitian specialising in infant and child nutrition. She has a wealth of clinical experience and advises on the management of paediatric conditions such as faltering growth, food allergy and intolerance, gastrointestinal disturbances such as constipation or reflux and fussy eating. Emily is a keen public speaker and delivers nutrition education events to health care professionals, companies and schools.\n View Details for Emily Bloxam"
        },
        {
            "name": "Alison Kyle",
            "title": "MSc. Nutrition, B Sc Nutrition and Dietetics, Certificate in Education",
            "bio": "Emily Foster is a Canadian trained, UK based, digital dietitian and founder of Glowing Potential, a digital health consultancy focusing on designing and creating evidence-based online health and wellness programming. Since 2017 she has worked with health and wellness brands to individual healthcare professionals such as WW (formerly, Weight Watchers), Deliveroo and 4th Discipline. Emily has been featured in the media as a nutrition and health expert on the BBC One Show (2020) and in other media outlets such as the UK’s The Mirror online and The Daily Express and Canada’s Global News Morning Live and CTV News. \n View Details for Emily Foster",
            "url": "https://www.facebook.com/glowingpotential/"
        },
        {
            "name": "Sarah Lindsay Brown",
            "title": "BSc (Hons), PG Dip, RD",
            "bio": "Emma is a specialist dietitian registered with the HCPC and is a member of both the diabetes and freelance specialist interest groups of the BDA. Emma has years of experience of working with individuals and groups, including families, to meet their health and nutrition goals. Emma has successfully worked with …\n\nEmma Jones\nRead More »\n\n\nView Details for Emma Jones"
        },
        {
            "name": "Alison Chambers",
            "title": "BSc Honors Nutrition & Dietetics PhD",
            "bio": "Eulalee Green is the lead Consultant Dietitian for Family Nutrition Coach. She has over 25 years’ experience as a Senior NHS Dietitian, Holistic Health Coach, and Public Health Nutritionist. Over her 25 years of providing clinical nutrition and dietetic services to children, men and women promoting health and managing a range of medical conditions.\n View Details for Eulalee Green",
            "url": "https://www.facebook.com/FamilyNutritionCoach/"
        },
        {
            "name": "Claire Pettitt",
            "title": "MSc, BSc (Hons), PGDip, RD",
            "bio": "Evangelos Tsatiris is a qualified, HCPC Registered Dietitian and a full member of the British Dietetic Association (BDA) and the Freelance Dietitians group, currently working in the area of Bristol. He is committed to forming relationships with people looking to lose or manage their weight, and deal with chronic conditions. …\n\nEvangelos Tsatiris\nRead More »\n\n\nView Details for Evangelos Tsatiris",
            "url": "https://www.facebook.com/evangelostsatiris/"
        },
        {
            "name": "Caroline Bletcher",
            "title": "Bsc Nutrition and Dietetics, Surrey University. Bsc Nutrition, The University of Nottingham",
            "bio": "Experience in the education sector, developing corporate policy, medical diets, GDPR, project implementation, team management.\n View Details for Elizabeth Owen"
        },
        {
            "name": "Hannah Oldfield",
            "title": "BSc, MSc, PG Dip",
            "bio": "Experienced dietitian with 25 plus years in practice. Sensitive, open minded, body positive, counselling approach. Adults age 16 plus. Video call from anywhere in the UK.\n View Details for Alison Holloway"
        },
        {
            "name": "Cristian Costas Batlle",
            "title": "BSc, PG Dip, RD",
            "bio": "Experienced dietitian with 25 years in practice. Coming from a very varied  career. Around 20 years NHS career; returning to academia in the the last 5 years, alongside  this  a variety of third sector employment and  community health improvement work. In the midst of setting up an exciting novel role …\n\nLouise Middleton\nRead More »\n\n\nView Details for Louise Middleton"
        },
        {
            "name": "Elaine Cossins",
            "title": "RD (Post grad with distinction), PhD Biochemistry, Post-grad diploma Sports and Exercise nutrition, MSc, BSc",
            "bio": "Experienced dietitian with interest in sarcopenic dysphagia, learning disabilities (adults), lecturing, writing and menu analysis. I have been published contributing to key chapters in respected reference books and enjoy writing articles on various aspects of people’s health and well-being. My passion is spreading the (evidence based ) word on nutrition …\n\nSian O'Shea\nRead More »\n\n\nView Details for Sian O'Shea"
        },
        {
            "name": "Dawn Smith",
            "title": "BSc Hons Dietetics, Registered Dietitian, MSc module Dietetic Management of Allergic Disease",
            "bio": "Experienced nutrition expert providing concrete dietary advice with more than 11 years NHS experience. Specialised in IBS (fodmap trained) and gut health but able to advise on a variety of other conditions. Empathetic and caring dietitian with passion and drive to improve the health of others. I am currently offering remote/virtual consultations at \"out of office times\" eg- evenings and weekends\n View Details for Alice Walker",
            "url": "https://www.facebook.com/rdnutritional/?ref=aymt_homepage_panel&eid=ARDXTPu9enDL1U5sTzlnbRXfPxdKYai899nNUl9Lyj8PwU5peR7w8jfX4shGUXCDLmS68aEp0RIxq2b4"
        },
        {
            "name": "Sophie McFarland",
            "title": "BSc (Hons) RD PhD AFHEA",
            "bio": "Experienced Paediatric Dietitian with interest in Infant Nutrition and Growth\n View Details for Nicole Dos Santos"
        },
        {
            "name": "Lydia Leighton",
            "title": "BSc (Hons) RD",
            "bio": "Fettle & Bloom was launched by Bath-based NHS dietitian Cristy Dean, to provide tailored, expert and dedicated support to those with irritable bowel syndrome and related gut health conditions. After graduating from the University of Plymouth with a first-class degree in nutrition and dietetics, Cristy spent many years working in …\n\nCristy Dean\nRead More »\n\n\nView Details for Cristy Dean",
            "url": "https://m.facebook.com/fettleandbloomnutrition/"
        },
        {
            "name": "Victoria Young",
            "title": "Bsc (Honors) RD",
            "bio": "Food and Nutrition Central offers you a professional nutrition and dietetic consultancy service.   With advice from a registered dietitian, you can be reassured that you will receive expert nutritional advice that is unbiased, evidence based and practical to meet your needs. \nWhether you are a company that is interested in the health and well being of your employees, a care provider, food retailer or the media, Food and Nutrition Central can provide the service you want when it comes to nutrition.\nDalhia Campbell is also a British Dietetic Association media spokesperson.\n View Details for Dalhia Campbell",
            "url": "https://www.facebook.com/Food-and-Nutrition-Central-266963373346988/"
        },
        {
            "name": "Ruth Harvey",
            "title": "Postgraduate Diploma Nutrition and Dietetics",
            "bio": "Freelance dietitian Based in Salisbury\n View Details for Victoria Young"
        },
        {
            "name": "Louise Middleton",
            "title": "MSc Public Health & Nutrition, BSc (Hons) Dietetics, PG cert Person Centred Practice",
            "bio": "Freelance Dietitian/Nutritionist for several food companies, since 1992 until present.  Since October 2016, employed as a NHS Bank Community Dietitian delivering several successful 12-week weight management programmes in London Borough of Sutton, promoting health and well-being to adults.\n View Details for Helen Gardiner"
        },
        {
            "name": "Sarah Mirza",
            "title": "BSc Nutrition and Dietetics",
            "bio": "Freelance specialist Dietitian who has a passion for helping patients to improve their health and well-being through dietary treatment that is practical, adaptable and tailored to the individual's needs and circumstances.\nI provide a service at various private hospitals including Springfield Hospital (Chelmsford) the Oaks Hospital (Colchester) and Spire Hartswood Hospital (Brentwood). I can offer face-to-face or virtual consultations.\nPatients can self refer or be referred by their GP or consultant.\nI have contracts with a number of private health insurance companies who may fund your treatment. You will need to contact your health insurance company directly for authorisation for any treatment.\n View Details for Nicole Croft-O’Halloran",
            "url": "https://www.facebook.com/ncroftohalloran/"
        },
        {
            "name": "Joe Alvarez",
            "title": "PgDip Nutrition and Dietetics, BSc (Hons) Nutrition",
            "bio": "Gastroenterology Dietitian Specialising in Coeliac Disease\n View Details for Cristian Costas Batlle"
        },
        {
            "name": "Anita Bowes",
            "title": "Masters of Science (MSc distinction) Nutrition & Dietetics - Leeds Metropolitan University; Post Graduate Diploma (PG Dip) Dietetics - Leeds Metropolitan University; Bachelors of Science (BSc 1st class hons) Nutrition & Food Science - Oxford Brookes University",
            "bio": "Gillian has extensive experience in the field of public health, having held leadership roles in obesity prevention, tobacco control, school health and early years nutrition.  \nGillian is a keen public speaker, facilitator, trainer and change management expert.\n View Details for Gillian Farren",
            "url": "https://www.facebook.com/nutrivitalitynutrition/"
        },
        {
            "name": "Jodie Relf",
            "title": "BSc Dietetics",
            "bio": "Gillian Killiner is the founder of 121 Dietitian a unique award wining nutritional consultancy service across Northern Ireland and the UK online and in clinic.  \nGillian has 24 years of hospital and freelance experience. Her company 121 Dietitian provides a wide range of services to individuals and businesses.  Using expert nutritional and medical information we assess and assist overall health allowing for complete nutritional optimisation. This ensures top performance and productivity.  \nSpecialist areas include physical and mental repair and recovery, gut health optimisation (Low FODMAP practitioners), treatment for resistant weight loss, hormonal balancing, optimisation for sports performance and repair for chronic illness sufferer's eg: High Blood pressure, Diabetes, Cancer, Metabolic health, autoimmune conditions. \nCompany talks, workshops and mini consultations are provided within the corporate setting to ensure the full workforce are tip top.\n View Details for Gillian Killiner",
            "url": "https://www.facebook.com/121-Dietitian-72888012751/"
        },
        {
            "name": "Paula Wood",
            "title": "BSc (Hons), MSc Public Health Nutrition",
            "bio": "Good food great futures!\nI write recipe books, articles, web posts and blogs as well as do a lot of presentations including cookery workshops to health care professionals and patients.\n View Details for Angharad Banner",
            "url": "https://www.facebook.com/abcdietitian/"
        },
        {
            "name": "Janet Gordon",
            "title": "BSc. Dietetics; HCPC Registered Dietitian DT03412; MBDA; ILM Level 3; VTCT L3 Assessor",
            "bio": "Graduating with a first class degree in Nutrition from the University of Nottingham, Charlotte went on to gain her MSc in Dietetics at King’s College London before qualifying as a Registered Dietitian. Since qualifying, Charlotte has gained a wealth of experience working in an array of medical specialisms …\n\nCharlotte Foster\nRead More »\n\n\nView Details for Charlotte Foster"
        },
        {
            "name": "Rachael Hunter",
            "title": "BSc Hons (RD)",
            "bio": "Hannah is a Registered Dietitian and Nutritionist who has a life-long and genuine passion for nutrition, health and food.  She supports individuals with one-to-one personalised dietetic consultations and empowers patients to make dietary and lifestyle changes to optimise their health. Hannah recognises that the world of wellness is full of confusing, …\n\nHannah Oldfield\nRead More »\n\n\nView Details for Hannah Oldfield"
        },
        {
            "name": "Alison Holloway",
            "title": "BSc (hons) RD",
            "bio": "Harriet Smith is an award-winning Dietitian and Health Writer who is registered with the British Dietetic Association (BDA) and Health and Care Professions Council (HCPC). \n\nHer business 'HRS Communications' is a Nutrition PR agency producing evidence-based content for over 30 food, nutrition, and medical nutrition companies globally. Their services include B2B copywriting, B2C copywriting, social media content creation, website copywriting, medical writing, podcast hosting, online course creation, and PR campaigns.\n\nAs a Health Writer, Harriet has over six years of experience writing for national, trade and consumer media. She was a Complete Nutrition (CN) Magazine Columnist for 18 months and was recently awarded the title of \"CN Writer of the Year\" for 2018.\n View Details for Harriet Smith",
            "url": "https://www.facebook.com/SurreyDietitian/"
        },
        {
            "name": "Laura Boyle",
            "title": "BSc Nutrition and Dietetics",
            "bio": "Having worked in adult dietetics I have moved to specialising in Paediatrics advising on infant feeding, weaning, fussy eating, faltering growth, obesity, bowel disorders, anaemia (and other nutrient deficiencies), Coeliac disease, Autism, and more. I have worked closely with young adults having anxiety linked eating problems resulting in either anorexic or obesity status as well as educating and supporting children and young adults with Type 1 Diabetes. \n\nAn opportunity to work at Britain’s most prestigious children’s hospital; Great Ormond Street Hospital for Children, allowed me to further develop my skills providing oral and enteral nutrition support in the dietetic management of challenging and rare clinical conditions. \n\nI have completed menu analysis and development projects within catering. I also have a Food Science degree and have worked in the Food Industry for ~ 10 years (research, product development and technical sales) so would welcome any technical projects too.\n View Details for Elaine Greenman"
        },
        {
            "name": "Eugenia Grand",
            "title": "BSc (Hons) Nutrition and Dietetics",
            "bio": "HCPC registered Dietitian/Nutritionist specialising in nutrition for children and adults\n View Details for Rebecca Stacey",
            "url": "https://www.facebook.com/FNClinic/"
        },
        {
            "name": "Will Hadfield",
            "title": "Specialist Dietitian (Masters of Nutrition with HCPC Accreditation Registered Dietitian)",
            "bio": "Heather Daniels is a registered dietitian and a member of the British Dietetic Association and Health Professions Council. She completed her Nutrition and Dietetics degree at Kings College London in 2005 and has since worked in both hospitals and outpatient clinic settings. Between 2006 and 2008, she worked as a Community Dietitian in …\n\nHeather Daniels\nRead More »\n\n\nView Details for Heather Daniels",
            "url": "https://www.facebook.com/expertdietadvice/"
        },
        {
            "name": "Tazmin Lewis",
            "title": "Nutrition and Dietetics Bsc",
            "bio": "Helen Bond BSc. (Hons) SRD, MBDA State Registered Dietitian and Consultant Dietitian Helen Bond is considered by many as one of the leading Dietitians in the UK.  Helen graduated in 1996 with a 2:1 BSc. Honours degree in Dietetics from Queen Margaret University College, Edinburgh, having incorporated six months studying …\n\nHelen Bond\nRead More »\n\n\nView Details for Helen Bond"
        },
        {
            "name": "Wendy Murray",
            "title": "Bsc Dietetics",
            "bio": "Helen is a registered dietitian based in Stockport, Greater Manchester and has worked for the NHS for the past 30 years. Over the 30 years Helen has worked in the NHS (for GPs, community and in hospitals), private sector (private weight management company) and public health (Wigan and across Greater …\n\nHelen Turner\nRead More »\n\n\nView Details for Helen Turner"
        },
        {
            "name": "Sharmain Davis",
            "title": "BSc (Hons). PG Dip. RD",
            "bio": "Helen runs her own Dietetic Private Practice in Brighton and Hove, online and in person. She currently works as a dietetic consultant at Bluecrest Healthscreening, is the sports nutrition tutor for Brighton University Sports Scholars, and enjoys incorporating the most up to date nutrition research into recommendations for businesses and writers.\n View Details for Helen Phadnis",
            "url": "https://www.facebook.com/TheBespokeNutritionCoach/"
        },
        {
            "name": "Anna Pain",
            "title": "BSC Hons NUTRITION AND DIETETICS",
            "bio": "Hello I'm Dr Stephanie Fade lover of food, science and health. I am passionate about helping schools and organisations innovate to improve health. My approach  is designed to enable you to generate and grow innovative ideas and test them out with your people to develop them at pace into high impact actions.\n View Details for Stephanie Fade",
            "url": "https://www.facebook.com/eatingmindset"
        },
        {
            "name": "Heather Daniels",
            "title": "BSc (Hons), RD",
            "bio": "Hello I’m Sarika, a registered dietitian with the Health and Care Professions Council (HCPC) and a member of The British Dietetic Association (BDA) for over 20 years.\nI have specialist knowledge in the field of weight management and diabetes.\n View Details for Sarika Mongia"
        },
        {
            "name": "Chloe Elliott",
            "title": "Registered Dietitian",
            "bio": "Hello! I’m Erin, a Specialist Mental Health Dietitian. I’m passionate about helping people improve their relationship with their bodies and their confidence with food. Whether it’s helping you find a meal structure that fits your life, incorporating food that makes you feel good, or helping get your lab results back …\n\nErin Adams\nRead More »\n\n\nView Details for Erin Adams"
        },
        {
            "name": "Jessica English",
            "title": "BSc Honours Nutrition and Dietetics, HCPC Registered Dietitian, Monash FODMAP trained Dietitian, Member of the BDA",
            "bio": "Hello! I’m Katie. I’m a Specialist Registered Dietitian with over 18 years experience working in the NHS, academia and private practice as a freelance Dietitian. I help individuals and families to find practical solutions to wellness and healthful living. I offer expert, up-to-date and evidence-based advice to reach your personal …\n\nKatie Psarou\nRead More »\n\n\nView Details for Katie Psarou"
        },
        {
            "name": "Elaine Greenman",
            "title": "BSc 1st Class Honours Degree",
            "bio": "Hello! I’m Yvonne. I’m a Registered Dietitian and Nutritionist with over 15 years experience working in the NHS and as a freelance Dietitian. I am passionate about my clients health care and helping people improve their life and achieve goals. If you are looking for a personalised, tailored plan to …\n\nYvonne Mitchell\nRead More »\n\n\nView Details for Yvonne Mitchell"
        },
        {
            "name": "Lucy Upton",
            "title": "Master of Nutrition, Registered Dietitian, HCPC DT25636",
            "bio": "Hello! My name is Barry Cullen and I’m the LivewellDietitian. I’m an expert in nutrition, based in Yorkshire, who is ready to help you with whatever your nutritional needs may be. If this involves having a medical condition that causes you symptoms, or you’re someone who wants to lose weight …\n\nBarry Cullen\nRead More »\n\n\nView Details for Barry Cullen"
        },
        {
            "name": "Azmina Govindji",
            "title": "RD MBDA",
            "bio": "Hello, I am Anastasia, a Registered Dietitian and Sports Nutritionist. I have a long-standing passion for nutrition and now as a qualified nutrition expert, I am delighted to be able to assess, diagnose and treat dietary and nutritional problems using scientific evidence and a personalised approach. To be more specific, the foundation …\n\nAnastasia Gkegka\nRead More »\n\n\nView Details for Anastasia Gkegka",
            "url": "https://www.facebook.com/NutritionSynergyuk"
        },
        {
            "name": "Victoria Holmes",
            "title": "MSc Nutrition and Dietetics",
            "bio": "Hello, I am Ros a children’s and eating disorder dietitian. I love creating a rapport with people and helping individuals improve their relationship with food. Working as a dietitian I get to combine my passion for communicating with people along with my love of nutritional science. I have over six …\n\nRoslyn Gray\nRead More »\n\n\nView Details for Roslyn Gray",
            "url": "https://facebook.com/dietitianros"
        },
        {
            "name": "Christine Kenny",
            "title": "BSc Hons Nutrition and Dietetics REPs Level Personal Trainer",
            "bio": "Hello, I'm Jen, a Registered Dietitian with a wealth of experience at helping people transform their relationship with food. Whether you are looking to optimise your general health, make specific dietary changes or reduce symptoms, I offer an individualised approach and can help you adopt a mindful and fresh attitude to good nutrition and health.\n View Details for Jen Credicott",
            "url": "https://www.facebook.com/jendietitian"
        },
        {
            "name": "Carole Tan",
            "title": "Registered Dietitian",
            "bio": "Hello, I'm Mairi Huntly. I enjoy recipe development and menu planning and I have recently completed the recipe analysis course to ensure the best practice for analysing recipes. I also enjoy media work and recently appeared on Food Unwrapped Summer diet special.\n View Details for Mairi Huntly",
            "url": "https://www.facebook.com/cambridgedietitian/"
        },
        {
            "name": "Dalhia Campbell",
            "title": "BSc Hons Dietetics",
            "bio": "Hello, I’m Pam. I am a Registered Dietitian and have 10 years of experience supporting people to change their relationship with food to help improve their overall health. I have extensive experience in the area of Adult Weight Management and my true passion is helping people to make positive lifelong …\n\nPam Finlay\nRead More »\n\n\nView Details for Pam Finlay"
        },
        {
            "name": "Helen Rose",
            "title": "BSc, RD",
            "bio": "Hello, My name is Anna. I have worked as a dietitian for 12 years in a large hospital and have a wide range of skills and experience. As a freelance dietitian, I offer friendly, individualised guidance and support to reach goals on; 1. Weight Management 2. Cholesterol lowering 3. Improving …\n\nAnna Pain\nRead More »\n\n\nView Details for Anna Pain"
        },
        {
            "name": "Katharine Sheldon",
            "title": "BSc hons dietetics, post graduate certificate in Education, post graduate diploma in Health promotion",
            "bio": "Hello, my name is Nusrat. I am an expert in nutrition in a range of areas particularly, diabetes (all types) and sport and exercise nutrition. I am a registered dietitian (BSc) and sport and exercise nutritionist (PG Cert) based in the Bradford/Leeds area of West Yorkshire. I can meet you …\n\nNusrat Kausar\nRead More »\n\n\nView Details for Nusrat Kausar"
        },
        {
            "name": "Rebecca Stacey",
            "title": "BA (Hons), BSc (Hons), RD",
            "bio": "Hi I’m Felicity. I specialise in helping people achieve better health and well-being through dietary and lifestyle changes. I love what I do, and understand how challenging it can be to try and change long held habits, and then hold onto those new habits. Specialist areas: Weight Reduction and Weight …\n\nFelicity Lyons\nRead More »\n\n\nView Details for Felicity Lyons"
        },
        {
            "name": "Maxine Palmer",
            "title": "2:1 BSc (Hons) Dietetics, Coventry University",
            "bio": "Hi I’m Izzy, I am an NHS Dietitian as well as a Sports Nutritionist.  I have worked for the NHS since 2014 treating patients with a range of conditions. I currently work with patients with Diabetes but I also have experience in kidney disease and gastrointestinal health including IBS and …\n\nIsabel Anderson\nRead More »\n\n\nView Details for Isabel Anderson",
            "url": "https://www.facebook.com/IzzyNutritionWorthing"
        },
        {
            "name": "Lucy Perrow",
            "title": "RD, MSc",
            "bio": "Hi my name is Wendy Murray and through my own  experiences, and that of seeing many people struggle in my practice, my passion is helping people get out of the dieting trap and learn to make peace with food , their body, gain self esteem and find a weight that …\n\nWendy Murray\nRead More »\n\n\nView Details for Wendy Murray",
            "url": "http://www.facebook.com/Wendy-Murray-Dietitian"
        },
        {
            "name": "Tony Hirving",
            "title": "BSc (Hons) Nutrition with Biology | MRes (Clin)",
            "bio": "Hi – I am Alex, a Registered Dietitian with twelve years’ clinical experience in the NHS in various settings including outpatient clinics, hospital wards and group education.  My specialties include gastroenterology and nutrition support.  Although I love my work for the NHS and this still takes up the majority of …\n\nAlex Evans\nRead More »\n\n\nView Details for Alex Evans"
        },
        {
            "name": "Alex Evans",
            "title": "BSc (Hons) Human Nutrition and Dietetics",
            "bio": "Hi! I’ve been working as a dietitian for over ten years and have worked in both the hospital and the community. My focus as a freelance dietitian is in weight management, gut health, sports nutrition and cancer survivorship & prevention. I have undertaken further study to varying levels in all …\n\nJo Robinson\nRead More »\n\n\nView Details for Jo Robinson"
        },
        {
            "name": "Vikki Poole",
            "title": "BSc Hons Nutrition and Dietetics",
            "bio": "Hi! My name is Vik Hilton. \nI am a registered dietitian that specialises in a variety of health conditions including gut health (gastroenterology), diabetes, cardiac and respiratory! Whether you are looking to prevent a condition, treat an existed condition or lose/ gain some weight - I can help! ! I offer 1:1 consultation appointments over video call for a range of conditions including IBS (low FODMAPs), Inflammatory bowel disease, liver disease, Coeliac, Diabetes and more!\n View Details for Victoria Hilton"
        },
        {
            "name": "Jo Price",
            "title": "BSc (Hons) RD",
            "bio": "Hi, I am a paediatric dietitian and a freelance health writer.\n View Details for Barira Saad"
        },
        {
            "name": "Cristy Dean",
            "title": "Bsc First Class (hons) RD, mBDA HCPC",
            "bio": "Hi, I’m Jackie Wilson, a specialist registered dietitian available for 1:1 online and telephone support ( evenings and weekends included)\nI have a particular interest in offering nutrition coaching for those people with diabetes ( type 1 and type 2) and also those with IBS (I have King’s college post graduate training in the low FODMAP diet) \nHaving extensive clinical experience over the last 29 years I am still enthusiastic about lifestyle change and  providing practical information on cooking, shopping and adapting family meals to suit your budget and clinical needs. I offer a free telephone discovery call to ascertain your goals and I look forward to hearing from you.\n View Details for Jacqueline wilson"
        },
        {
            "name": "Jenny Stevens",
            "title": "Masters of Nutrition",
            "bio": "Hi, I’m Maxine an experienced Dietitian & Nutritionist. If you want support to achieve a health goal, I specialise in Weight loss programmes, IBS packages, Vegan Diets, Meal plans & Recipes for health & fitness businesses, Workplace Health, Business Consultancy services and more.\n View Details for Maxine Palmer",
            "url": "https://www.facebook.com/maxine.palmer.7923"
        },
        {
            "name": "Saira Khan",
            "title": "BSC (Honors) RD",
            "bio": "Hi, my name is Eugenia. I am a freelance dietitian nutritionist specialising in fertility, pregnancy and female health.\n View Details for Eugenia Grand",
            "url": "https://www.facebook.com/dietitianeugenie"
        },
        {
            "name": "Deborah David",
            "title": "BSc Hons. Nutrition & Dietetics, PGCE, MSc. Virology",
            "bio": "Hi.  I am a registered dietitian with over 12 years experience working within the NHS, abroad and in research.  I offer services to women with a focus on gut health, maternal nutrition and weaning.  My business Pod&Pea Nutrition is based in Exeter.  I can offer virtual individual consultations, as well as virtual and in-person group education including workshops, food festival talks and demos, staff health and wellbeing days, media copy and recipe/diet analysis.\n View Details for Ruth Harvey",
            "url": "https://www.facebook.com/podpeanutrition/"
        },
        {
            "name": "Sheri Taylor",
            "title": "Registered Dietitian",
            "bio": "Highly experienced Gastroenterology Dietitian working in the NHS & Private Practice at The Dietary Edit. I offer face to face, online & phone consultations. I am trained to assess, diagnose and treat with diet and nutrition a variety of health concerns.\nContact me for a free discovery consultation to find out how I can support your health through nutrition 0115 648 1884\n View Details for Nichola Williams",
            "url": "https://facebook.com/thedietaryedit"
        },
        {
            "name": "Sheri Taylor",
            "title": "Registered Dietitian",
            "bio": "I am  a HCPC registered detitian (BSC Hons Dietetics), which means I am fully regulated to guide you by providing up-to-date information that is purely evidence based. This means it has undergone rigorous evaluation and scientific studies. I have a passion for food, health and promoting evidence based healthy eating advice. I can help you achieve/improve your personal wellness! My aim is to support you through this journey of achievement to improve your symptoms and optimise your nutritional status.\n View Details for Elizabeth McCabe",
            "url": "https://facebook.com/deliziouslylizzinlife"
        },
        {
            "name": "Evangelos Tsatiris",
            "title": "● BSc Dietietics ● MSc Nutrition, Physical Activity & Public Health ● BSc Psychology ● MSc Health Psychology",
            "bio": "I am a dietitian who is passionate about helping people achieve their nutrition and lifestyle goals in a realistic sustainable way. I have over 7 years experience of working in the NHS which has given me a vast amount of experience across all areas of dietetics in a clinical and …\n\nSoraya David-Pineda\nRead More »\n\n\nView Details for Soraya David-Pineda"
        },
        {
            "name": "Neha Parekh",
            "title": "BSc Honours RD",
            "bio": "I am a dietitian with an honours degree in Nutrition and Dietetics. I’m also a qualified chef and I believe this combination of skills allows me to provide a holistic approach to nutrition-related health problems. I’ve spent the past eighteen years working in the specialised area of bariatric (weight loss) …\n\nGail Pinnock\nRead More »\n\n\nView Details for Gail Pinnock"
        },
        {
            "name": "Jill Scott",
            "title": "MSc RD",
            "bio": "I am a dietitian with over 20 years of experience working in the field of nutrition and dietetics. \nI am a firm believer in the benefits of a healthy diet to optimise health and wellbeing. I recognise that we all have different nutritional requirements and that these requirements change at various times through our lives e.g. age, levels of activity and illness. I also understand the pressures and strains of daily life and how these can sometimes negatively impact on eating patterns and food choices!  I will offer clear, practical and realistic advice based on lifestyles, to help achieve and maintain optimum health benefits through the appropriate nutrition.\n View Details for Paula Wood",
            "url": "https://m.facebook.com/PaulaWoodNutritionUK/?locale2=en_GB"
        },
        {
            "name": "Jo Cunningham",
            "title": "BSc (Honors) RD",
            "bio": "I am a dynamic and experienced Registered Dietitian based in Bristol who can help your business with projects such as:\nNutrition consultancy\n1:1 consultations\nWorkplace health seminars\nStaff nutrition education and training\nGroup education for health promotion\n\nContact me today to find out more!\n View Details for Sophie Claessens"
        },
        {
            "name": "Symone Genovezos",
            "title": "Registered Dietitian",
            "bio": "I am a Fertility Specialist Dietitian with experience across private healthcare, NHS and public health fronts. Open to liaisons working with innovative ventures and start ups at mutually beneficial terms. Currently serve as Joint Chair- Maternal and Fertility Nutrition Group at British Dietetic Association. I have been fortunate to have contributed towards the development of patient resources for Pregnancy and Male fertility for the British Dietetic Association. I am also part of a research team at University of Plymouth working to understanding functional gut symptoms in Endometriosis. My approach is evidence based and easy to follow. Website: https://ukfertilitynutrition.com/\n View Details for Komal Deepak Kumar"
        },
        {
            "name": "Susan Burry",
            "title": "RD, MSc (Obesity), MBA, PCert Plant Based Nutrition",
            "bio": "I am a freelance dietitian, hoping to work with clients to forge a trusting, non-judgemental relationship that allows us to work toward your goals.  I have advanced behaviour change skills to help you make changes for the long term and to establish dietary change.  However difficult that may seem at present.  I am more than happy to work with you for weight management, gut disorders, fertility issues including PCOS and dietary assessment of vegan and vegetarian diets.  Please get in touch if you would like to discuss your needs further.\n View Details for Jenny Bazely"
        },
        {
            "name": "Melinda Boyd",
            "title": "DCN, MPH, MHR, RD, FAND",
            "bio": "I am a fully committed and highly experienced Registered Dietitian with over 20 years of post-graduate experience working in NHS and private hospitals in both Edinburgh and Glasgow. My particular area of interest is the treatment of Eating Disorders and I have worked in specialist in-patient units for the treatment …\n\nHazel Elliott\nRead More »\n\n\nView Details for Hazel Elliott"
        },
        {
            "name": "Rachel Wood",
            "title": "BSc Hons Dietetics",
            "bio": "I am a HCPC registered dietitian with 7 years experience working in the NHS with experience in presenting and lecturing in a wide range of topics including GI disorders, fad diets and dispelling the myths.\n View Details for Naomi Ronan"
        },
        {
            "name": "Sarika Mongia",
            "title": "BSc Nutrition, PGDip, RD",
            "bio": "I am a HCPC registered Dietitian with over 13 years experience working in the National Health Service (NHS) across a wide variety of clinical areas in leading teaching hospitals in Liverpool and London. I have worked as a Highly Specialist Dietitian in Inflammatory Bowel Disease (IBD) since 2010 gaining extensive …\n\nKatie Barton\nRead More »\n\n\nView Details for Katie Barton"
        },
        {
            "name": "Stephanie Fade",
            "title": "BSc Nutrition First Class Hons, Postgraduate Diploma Dietetics, PhD",
            "bio": "I am a highly experienced NHS paediatric Dietitian (25 years) and offer practical translation of research and evidence into nutrition solutions.  An effective communicator at all levels from 1:1 to large groups. Combine this with industry experience in manufacturing and product development, I could have just what you are looking for.\n View Details for Jo Rayner"
        },
        {
            "name": "Clare Clement",
            "title": "BSc (Hons) Applied Human Nutrition and Dietetics",
            "bio": "I am a highly motivated Freelance Dietitian providing clinical expertise, consultancy, and training. I have over 25 years experience of supporting individuals who need dietary advice to overcome medical conditions, and groups and organisations to improve health through good nutrition and healthy lifestyles. I am passionate about the effect that good …\n\nDeborah Norman\nRead More »\n\n\nView Details for Deborah Norman"
        },
        {
            "name": "Caroline Hill",
            "title": "BSc (Hons) Food and Nutrition. MSc Nutrition and Dietetics.",
            "bio": "I am a Highly Specialised Paediatric Dietitian, with over 15 years experience within the NHS and private sector,currently working at the largest children’s hospital in the UK.  My private practice clinic is based in Bramhall, Cheshire but I also offer video and phonecall consultations. The Specialities I cover include: -Cows …\n\nVictoria Holmes\nRead More »\n\n\nView Details for Victoria Holmes"
        },
        {
            "name": "Maria Kolotourou",
            "title": "BSc (Hons), MSc, RD",
            "bio": "I am a registered dietitian and have worked for many years both in the NHS and as a freelance dietitian.  I qualified as a dietitian from Robert Gordon University, Aberdeen in 1986 and progressed to study for a Masters degree in Nutrition at the Rowett Research Institute/ Aberdeen University and …\n\nAlison Kyle\nRead More »\n\n\nView Details for Alison Kyle"
        },
        {
            "name": "Eulalee Green",
            "title": "RD mBDA BSc MSc, Consultant Dietitian & Holistic Health Coach",
            "bio": "I am a registered dietitian and performance nutritionist. If you want to realise your sporting goals and ambitions through enhanced and personalised nutrition then I can help you. I have enjoyed a great career in the NHS working both as a clinical dietitian and as a senior manager. My passion in sports nutrition is further fuelled by my daughter being a GB and international junior rower. I have both the theoretical and practical knowledge to give you sound evidence based  and tailored advice.\n View Details for Ruth James"
        },
        {
            "name": "Helen West",
            "title": "BSc MSc RD",
            "bio": "I am a Registered Dietitian since 2000 and I have gained extensive experience in many medical conditions, health promotion, school nutrition and performance nutrition. In 2003, I qualified as an Accredited Sports Dietitian and started up my sport nutrition consultancy: Victory Nutrition. I have also completed a MSc Module in …\n\nVanessa McMinn\nRead More »\n\n\nView Details for Vanessa McMinn",
            "url": "https://en-gb.facebook.com/pages/category/Nutritionist/Victory-Nutrition-1601289746776177/"
        },
        {
            "name": "Nicole Dos Santos",
            "title": "BSc (Med)(Hon) RD",
            "bio": "I am a Registered Dietitian specialising in Irritable Bowel Syndrome (IBS), the Low FODMAP Diet (formal training), Sports Nutrition, Coeliac Disease, Crohn's Disease, Ulcerative Colitis, Liver Disorders, Weight Loss, Healthy Eating and Wellbeing. I use individualised and practical advice to help my clients achieve their goals and optimise their health, fitness and wellbeing.\nI am flexible, based around southwest London and also offer Skype/FaceTime consultations if that’s more convenient.\n View Details for Evelyn Toner",
            "url": "https://www.facebook.com/foodshipbyevelyn/"
        },
        {
            "name": "Sadia Latimer",
            "title": "BSC (Hons) Biochemistry, MSc Human Nutrition, PGDip in Dietetics",
            "bio": "I am a registered dietitian specialising in supporting and advising parents and carers with a wide variety of infant and childhood feeding and dietary issues. I am able to offer prompt support to families requiring dietary advice for their children and also to breastfeeding mothers.\n View Details for Joleen Sutcliffe"
        },
        {
            "name": "Ruth James",
            "title": "MSc MBA RD DipM PGTC Dip in Coaching and Counselling",
            "bio": "I am a registered dietitian who specialises in weight management, type 2 diabetes and restoring intuitive and natural eating patterns. I take a holistic approach to my care and promote overall wellbeing and health through nutrition, exercise coaching and stress management.\n View Details for Ian Thomas",
            "url": "https://www.facebook.com/HealixBN/"
        },
        {
            "name": "Rachel Zibe",
            "title": "BSc (Hons) Pharmacology and Physiology; Postgraduate Diploma in Dietetics; International Olympic Committee Diploma in Sports Nutrition",
            "bio": "I am a registered dietitian with 17 years dietetic experience across the NHS and medical nutrition industry. During my dietetic career I have developed a passion for working with children and their families to establish good eating habits and a positive relationship with food. I have extensive experience in paediatric dietetics across different areas which include weaning, food allergy, faltering growth, fussy eating, tube feeding and tube weaning, blended and texture modified diets. My time working for industry has developed my skills in product launch and marketing, selling, delivering training, developing patient and HCP resources, medical writing of articles and scientific review and application of scientific literature. My experience allows me to consider the “wider” picture when planning and delivering projects and/or patient care.\n View Details for Danel Tainton"
        },
        {
            "name": "Lisa Bailey",
            "title": "MNutr, RD",
            "bio": "I am a registered dietitian with 20 years experience working in the NHS I have spent most of my career working in the community, preventing ill health and coaching clients to achieve their personal goals. I am particularly interested in supporting transgender and gender non-binary people to establish and maintain …\n\nAnn Johnson\nRead More »\n\n\nView Details for Ann Johnson"
        },
        {
            "name": "Emily Foster",
            "title": "B(A)Sc. RD",
            "bio": "I am a registered dietitian with over 20 years experience of working in weight management. I was the lead dietitian in several NHS specialist weight management services supporting people with severe weight problems so I understand what a difficult, complex and frustrating challenge managing weight can be. I set up …\n\nClare Grace\nRead More »\n\n\nView Details for Clare Grace",
            "url": "http://www.facebook.com/relishnutrition01"
        },
        {
            "name": "Hilary Du Cane",
            "title": "MBA, BSc (Hons), DipM, Dietitian",
            "bio": "I am a registered dietitian, passionate about food and how it affects health and wellbeing.  I want to share my knowledge to help people make well-informed food choices. I currently work in the NHS providing nutrition advice for individuals with kidney disease but I also have wide experience in the nutritional aspects of …\n\nSue Dawe\nRead More »\n\n\nView Details for Sue Dawe"
        },
        {
            "name": "Rachel Clarkson",
            "title": "RD PGDip MSc BSc",
            "bio": "I am a Registered Dietitian, specialised in weight management. Experienced nutritional consulting both groups and individual patients. I am helping people change their eating behaviours to lose weight and be healthier by using Cognitive Behaviours Therapy methods. You can expect to be supported throughout the whole process and get new …\n\nMenahem Harati\nRead More »\n\n\nView Details for Menahem Harati",
            "url": "https://www.facebook.com/FunDietHaratiNutrition"
        },
        {
            "name": "Ghazala Yousuf",
            "title": "BSc, MSc",
            "bio": "I am a registered Paediatric Dietitian with expertise in food allergy, faltering growth and fussy eating. I have worked in the NHS for nearly 20 years and am passionate about improving children’s lives. I have worked with patients who have diabetes, Coeliac Disease, poor growth, those who require nutrition through …\n\nGill Ashton\nRead More »\n\n\nView Details for Gill Ashton"
        },
        {
            "name": "Clare Thornton-Wood",
            "title": "BSc(Hons) RD",
            "bio": "I am a registered private practice and freelance clinical & sports dietitian with 18 years of clinical NHS experience working in many areas. My passion is to provide reliable, practical and tailored nutritional advice that helps my clients to make informed dietary decisions. I am an empathetic, friendly and caring …\n\nLisa Rowlands\nRead More »\n\n\nView Details for Lisa Rowlands"
        },
        {
            "name": "Makheale Shirley Mabindisa",
            "title": "Bachelor Of Nutrition RD",
            "bio": "I am a registered UK Dietitian with a Masters in Advanced Dietetic Practice. I am a member of The British Dietetic Association, British Burn Association and BDA Paediatric Specialist Group. I currently work in an NHS teaching hospital as a Clinical Lead Burn & Complex Wound Dietitian in addition to …\n\nEmily (Tig) Bridge\nRead More »\n\n\nView Details for Emily (Tig) Bridge",
            "url": "https://www.facebook.com/thedietaryedit"
        },
        {
            "name": "Emily (Tig) Bridge",
            "title": "MNutr MSc RD",
            "bio": "I am a Research Fellow in Nutritional Metabolism at the University of Surrey, current working on a project looking at the health effects of saturated fat. I am also considered one of the world leading experts in intermittent fasting, having picked up several awards along the way in my career from the Nutrition Society and European Association for the Study of Obesity.\n View Details for Dr Rona Antoni",
            "url": "https://www.facebook.com/RantOniRD/"
        },
        {
            "name": "Felicity Lyons",
            "title": "BSc (Honours) Nutrition PG Dip Dietetics PG Certificate Sports Nutrition",
            "bio": "I am a state Registered Dietitian with extensive experience working with services within the NHS, public and private healthcare.   I focus on you, work around your lifestyle; help you understand the underlying cause of your symptoms or health problems and the link between food, health, wellbeing and disease.  I offer …\n\nCarole Tan\nRead More »\n\n\nView Details for Carole Tan"
        },
        {
            "name": "Ailsa McHardy",
            "title": "BSc (Hons) RD",
            "bio": "I am a UK-registered dietitian based in near Toulouse in the south west of France.\nI qualified as a dietitian in 2001 and have worked with adults and children in the NHS up until leaving the UK in 2016.\nI set up my private freelance practice in October 2018\nMy website is www.yournutritionisvital.com.\nI offer face-to-face consultations for those living nearby in France and virtual consultations using Skype or WhatsApp\n View Details for Elaine Cossins",
            "url": "https://facebook.com/elaine.cossins"
        },
        {
            "name": "Louise Symington",
            "title": "BSc (Hons) MSc (Food Sustainability)",
            "bio": "I am a very experienced children’s dietitian.  I graduated in 2003 from the University of Wales Institute Cardiff (UWIC) with a BSC honours degree in Nutrition and Dietetics with registration. Since then I have worked in a range of NHS Hospitals from large teaching hospitals to smaller more local hospitals. …\n\nAnne Cushen\nRead More »\n\n\nView Details for Anne Cushen",
            "url": "http://facebook.com/cushen.nutrition"
        },
        {
            "name": "Joanna Lenz",
            "title": "BSc (Joint Hons), PGDip, RD",
            "bio": "I am an advanced specialist dietitian, passionate about everything related to nutrition and my main strength is my deep desire to help individuals achieve their long-term wellbeing goals.\nWith nearly 10 years of experience in both outpatient and inpatient for Eating Disorders (anorexia nervosa, bulimia nervosa, binge eating, ARFID and food refusal) and experience with Autism Spectrum Disorder, Mental Health illness and Sequential Oral Sensory – SOS approach to feeding.  \nIn addition, I have a wealth of experience – both professionally and personally – in Sport Nutrition where I have had the privilege of working with Olympic athletes, Ironman, ultrarunning, swimming, football among others. \nCombined with a coaching approach and my training in Motivational Interviewing and Cognitive Behaviour Therapy, I am well equipped to provide the highest standard of care.\n View Details for Paola Falcoski"
        },
        {
            "name": "Lisa Rowlands",
            "title": "BSc (Hons) RD, PGDip",
            "bio": "I am an Eating Disorder Dietitian, specialising in adolescent and adult eating disorders and sports nutrition. I support my clients to have a better relationship with food and to return to a healthy weight and lifestyle. I can support you in ensuring your meal plan encompasses all your essential nutrients, in all dietary choices, including vegetarian and vegan. Every person has their own challenges, so we can put together a package that works for you, be it helping you plan a weekly meal plan, eating or shopping with you and supporting you to challenge your thoughts around food.\n View Details for Maja Berry"
        },
        {
            "name": "Elizabeth McCabe",
            "title": "BSc (Hons) RD",
            "bio": "I am an experienced dietitian who has extensive experience in the food industry (6 years at the Food & Drink Federation as Nutrition Manager), academia (research, writing courses and lecturing at undergrad and M.Sc. level), many years’ experience in a variety of NHS settings and have published books, articles and in academic journals.  I am a practised speaker and have workplace well-being experience. I have experience with Cooking demos.\n View Details for Gaynor Bussell",
            "url": "https://business.facebook.com/GBLifeCoaching/"
        },
        {
            "name": "Anastasia Gkegka",
            "title": "RD, SENr BSc Food and Human Nutrition MSc Applied Sport and Exercise Nutrition MSc in Dietetics",
            "bio": "I am an experienced dietitian who takes a holistic and realistic approach to health.  I focus on nutritional quality, provenance and environmental sustainability to create positive changes for individuals and businesses. I’m an active committee member of the Sustainable Diets Group for the BDA. My unique knowledge and innovative skills …\n\nRosa Holt\nRead More »\n\n\nView Details for Rosa Holt"
        },
        {
            "name": "Dahlia Kulkarni",
            "title": "BSc Human Nutrition & Dietetics - RD",
            "bio": "I am an experienced Dietitian with 20 years post graduate practice. I have extensive experience across a wide range of dietetic areas with particular skills in diabetes, heart health, allergy, malnutrition and elderly care including dementia. I am a good listener and will help you understand how diet could improve …\n\nMarie Skerry\nRead More »\n\n\nView Details for Marie Skerry"
        },
        {
            "name": "Danel Tainton",
            "title": "B.Dietetics, University of Pretoria, South Africa",
            "bio": "I am an experienced dietitian with nearly 30 years experience.  I specialise in paediatrics (I have experience in all areas), food allergy/intolerance, coeliac disease and IBS.  I am an accomplished nutrition writer and have written articles for Dietetics Today, Complete Nutrition, Nursing in Practice and other health publications.  I am a British Dietetic Association Media spokesperson.  I have worked as a consultant for a number of different nutrition companies, producing printed patient resources, web copy and as a speaker at consumer events.  I am a visiting lecturer on the Nutrition and Dietetic and Physician Associate courses at the University of Hertfordshire and on the MSc Nutrition course at the University of Surrey.\n View Details for Tanya Thomas"
        },
        {
            "name": "Joana Jardim",
            "title": "BSc Nutrition & Food Sciences; MSc Clinical Nutrition",
            "bio": "I am an experienced Dietitian, having qualified in 2004 and working in the NHS Since then. Now working freelance alongside an NHS role.\n View Details for Gemma Collins"
        },
        {
            "name": "Victoria Francis",
            "title": "BSc Honours Nutrition and Dietetics.",
            "bio": "I am an experienced Registered Dietitian (RD) with a specialist interest and training in paediatric nutrition Contact me for a free initial discussion, to see how I might help you.\n View Details for Clare Thornton-Wood"
        },
        {
            "name": "Maja Berry",
            "title": "BSc (Hons) RD",
            "bio": "I am an experienced, friendly dietitian with over 25 years experience after I obtained my degree from Surrey University. Privately I see children with a variety of conditions including food allergy, faddy eating behaviours, weight management and for general health advice and nutritional assessment. I have undertaken many projects, working as …\n\nDenise Kennedy\nRead More »\n\n\nView Details for Denise Kennedy",
            "url": "http://facebook.com/denise.kennedy.5437"
        },
        {
            "name": "Kate Twine",
            "title": "Registered Dietitian and Nutrition Consultant BSc (Hons), PGDipDiet, RD, DMS, HCPC Registered, MBDA",
            "bio": "I am available for freelance projects specialising in translating complex evidence and science into straightforward and practical advice. \n\nThis includes developing patient, workplace and health and care professional literature and training, particularly in the areas of diabetes, heart health and nutrition support. \n\nAt present training is provided via online training sessions allowing staff including healthcare professionals and care home staff to join from a location of their choice. \n\nI am also available to write magazine and newspaper articles and blog posts and give talks and lectures.\n View Details for Paula Gallon",
            "url": "https://www.facebook.com/PaulaGallonDietitian/"
        },
        {
            "name": "Jean Sullivan",
            "title": "BSc (Hons) Human Nutrition, MSc (Clinical Research), Registered Dietitian",
            "bio": "I am a registered dietitian with over 10 years of experience in a senior position within the NHS. I’m passionate about nutrition and the science behind it and could talk about it all day! There are many mixed messages about nutrition, more so in recent years causing much confusion. As a dietitian, I …\n\nSaira Khan\nRead More »\n\n\nView Details for Saira Khan"
        },
        {
            "name": "Sarah Lumley",
            "title": "BSc Hons Dietetics",
            "bio": "I am dietitian offering online dietetic advice. I provide advice on a range of diets and can help to find the best diet for specific medical conditions and weight loss. I have found that not all diets suit all people! My role is to find a dietary solution that works …\n\nAlison Chambers\nRead More »\n\n\nView Details for Alison Chambers"
        },
        {
            "name": "Ann Johnson",
            "title": "BSc (Hons) Human Nutrition and Dietetics",
            "bio": "I am Francisco Vallejo a registered Registered Dietitian with the Health & Care Professions Council (HCPC) and a member of the British Dietetic Association (BDA). I hold a 4 years degree in Nutrition and Dietetics and a Master’s Degree in Quality, Hygiene and Food safety. I have gained significant experience …\n\nFrancisco Vallejo Castillo\nRead More »\n\n\nView Details for Francisco Vallejo Castillo",
            "url": "https://www.facebook.com/NutritionSynergyuk"
        },
        {
            "name": "Denise Kennedy",
            "title": "BSc(Hons) Nutrition, Registered Dietitian, PGCert",
            "bio": "I am Joe Alvarez, a Registered Dietitian offering a range of services, but specialising in gut health & IBS management. With a proven track record using evidence based methods to treat 100’s of people just like you. ​ IBS and other digestive issues can get in the way of your life and prevent you from …\n\nJoe Alvarez\nRead More »\n\n\nView Details for Joe Alvarez",
            "url": "https://www.facebook.com/Joealvarezdietitian/"
        },
        {
            "name": "Lucy Neary",
            "title": "BSc Hons Nutrition & Dietetics",
            "bio": "I am passionate about combining nutrition and medical care to provide the best support for my clients. I offer 1-to-1 appointments (eating disorders, gut health, oncology, weight management), group workshops, media work, article writing, menu analysis and much more. Please call me on 07814736841 to discuss how I can help you.\n\nI love new challenges and through my varied work experiences, I have many transferable skills and am able to adapt my nutritional knowledge to a multitude of projects.\n View Details for Laura Coster",
            "url": "https://www.facebook.com/AskYourDietitian/"
        },
        {
            "name": "Jacqueline Galanty",
            "title": "BSc (Hons) Nutrition and Dietetics, HCPC Registered Dietitian",
            "bio": "I am passionate about food and improving lives through good nutrition and supporting a sensible and healthy relationship with what we eat. As a Dietitian I provide expert food and nutrition advice to both individuals and groups. My philosophy is that you are what you eat and that it is …\n\nLydia Leighton\nRead More »\n\n\nView Details for Lydia Leighton",
            "url": "https://www.facebook.com/lydialnutrition/?modal=admin_todo_tour"
        },
        {
            "name": "Marcela Fiuza",
            "title": "BSc honours, MSc, PgDip, RD",
            "bio": "I am passionate about supporting people to make and sustain changes to their health, lifestyle, and food choices. I have over 20 years of clinical experience in working with people and corporate bodies to achieve specific health objectives. Working with a friendly team of experts, I provide evidence-based nutrition services that is personalised to individuals, and tailored to organisations and corporate bodies.\n View Details for Douglas Twenefour",
            "url": "https://www.facebook.com/24healthdotnet"
        },
        {
            "name": "Sian Riley",
            "title": "MSc Nutrition & Dietetics",
            "bio": "I am Reema Patel, a Registered Dietitian and member of the Health & Care Professions Council (HCPC) & the British Dietetic Association (BDA). I hold a Bachelor of Science in Nutrition & Dietetics from The University of Surrey, and a Master of Science in Sports and Exercise Nutrition from Loughborough …\n\nReema Patel\nRead More »\n\n\nView Details for Reema Patel"
        },
        {
            "name": "Vandhana Patel",
            "title": "Bsc(Hons) RD",
            "bio": "I am Sarah Lindsay Brown; a registered dietitian with a nutrition degree and postgraduate dipolma in dietetics. I have 11 years experience as a dietitian since qualifying and 15  years work experience since completing my nutrition degree. My work has been varied but has mostly had some focus on pregnancy, …\n\nSarah Lindsay Brown\nRead More »\n\n\nView Details for Sarah Lindsay Brown",
            "url": "https://www.facebook.com/teenyweaning/"
        },
        {
            "name": "Anna Hardman",
            "title": "BSc (Hons) Nutrition, PGDip Dietetics, Non Medical Prescribing (V300)",
            "bio": "I graduated from the University of Surrey in 2009 with a first degree honours and since have been privileged to gain over 10 years experience working in acute hospitals covering medical wards and outpatient clinics. I’ve specialised in HIV, gastroenterology and oncology and have an extensive knowledge of nutrition support …\n\nEmma Ferris\nRead More »\n\n\nView Details for Emma Ferris"
        },
        {
            "name": "Megan Rossi",
            "title": "BSc (Nutrition and Dietetics); PhD",
            "bio": "I have 10 years of NHS experience and have worked with all age groups, from premature babies to older adults. My particular areas of experience and expertise are infant feeding, food allergy and intolerance, the low FODMAP diet for IBS and eating well during illness. I also love to promote …\n\nAilsa McHardy\nRead More »\n\n\nView Details for Ailsa McHardy"
        },
        {
            "name": "Kylie Bishop",
            "title": "BSc (Hons) RD MBDA",
            "bio": "I have a range of NHS experience working with children and adults, I am not looking to use this experience in other area's.\n View Details for Cathy Redman",
            "url": "http://fb.me/dartmoordietetics"
        },
        {
            "name": "Bini Suresh",
            "title": "BSc (hons) Human Nutrition and Dietetics, PgDip Advanced Practice in Diabetes, PgDip Sports Exercise and Nutrition.",
            "bio": "I have been a qualified dietitian for the past 8 years and my mission is to increase health awareness and contribute in improving people's well being, taking into account their individual needs. I fully believe that the right diet and nutrition can make a huge difference to our health and quality of life.\n View Details for Penny Vlachou",
            "url": "http://nutreatglasgow/"
        },
        {
            "name": "Gaynor Bussell",
            "title": "B.Sc (Hons) Nutrition, Registered Dietitian, HPCP, MBDA",
            "bio": "I have been a registered dietitian for 21 years. I have worked in several hospitals throughout the northwest since graduating in 1998 and gained a broad range of experience in that time.I began my freelance career as I realised that not all people who required reliable, trustworthy nutritional advice could access it easily.I specialise in the treatment of digestive problems, weight management, heart health, diabetes and nutrition during cancer treatment, having spent a large proportion of my NHS career in working within these areas.I believe it is vital to have a diet that suits our lifestyle and that we enjoy! This is why I am passionate about working with my clients to find a diet that suits their individual needs and preferences, whatever their healthcare concern or medical diagnosis might be.I am fully trained through Kings College, London to provide advice on the FODMAP diet for IBS.I provide one to one consultations in my clinic and at BMI Hospital in Lancaster.\n View Details for Mairi Wilcock",
            "url": "https://www.facebook.com/stannernutrition/"
        },
        {
            "name": "Laura Kyte",
            "title": "BSc (Hons) Nutrition/Dietetics, PgCert Advanced Professional Practice",
            "bio": "I have been a Registered Dietitian for 3 years following graduation from King’s College London. As a community dietitian I have gained extensive experience in helping clients in their own homes, as well as in clinics and nursing homes, with a variety of nutrition and diet related issues. Having seen …\n\nSarah Mirza\nRead More »\n\n\nView Details for Sarah Mirza"
        },
        {
            "name": "Dorottya Norton",
            "title": "BSc Hons (RD)",
            "bio": "I have been a Registered Dietitian in Hull & East Yorkshire since 2009 working with a wide range of people to improve their health. Skillset: Mentoring and Coaching Critical Care Endocrinology Respiratory medicine Nutrition Support Pre and Post Surgical Rehab I am now also a qualified Personal Trainer using my …\n\nCarly Killen\nRead More »\n\n\nView Details for Carly Killen",
            "url": "https://facebook.com/CarlyKillenPT"
        },
        {
            "name": "Tess Warnes",
            "title": "BSc (Hons) RD",
            "bio": "I have been practicing as a self-employed dietitian for many years.  My main areas of work are Private Practice ( inpatient and outpatients) as well as Nutrition Consultancy. I am a past Chairman of the BDA and have been involved in the BDA for most of my working life.  I …\n\nLuci Daniels\nRead More »\n\n\nView Details for Luci Daniels"
        },
        {
            "name": "Isabel Hooley",
            "title": "PgDip RD",
            "bio": "I have been working as a registered dietitian for 12 years.  Most of my time has been spent working in the NHS with more recent overseas experience.   I have a vast range of knowledge in many medical conditions. I work with adults and children to tailor individual dietary advice, depending …\n\nEmma Biddle\nRead More »\n\n\nView Details for Emma Biddle"
        },
        {
            "name": "Marcelle Glantz",
            "title": "BSc (Honors) RD",
            "bio": "I have broad range of experience of delivering tailored dietetic advise to NHS patients in a hospital, clinic and group setting. I offer online consultations for meal plans and diet analysis. Please have a look at my website for more information about me, my experience and my services.\n View Details for Jasmine Carbon",
            "url": "https://www.facebook.com/CarbonNutritionandDietetics/?ref=bookmarks"
        },
        {
            "name": "Carly Killen",
            "title": "BSc Nutrition and Dietetics, MSc Innovative Healthcare",
            "bio": "I have experience of working for a global medical nutrition company therefore have a range of skills and expertise to support in this area, including new product launches, marketing material development, clinical evidence reviews.\n\nIn addition to this, I am able to provide menu and dietary analysis, plus corporate health and wellness training.\n\nI also provide virtual 1-1 consultations for a wide range of clinical conditions including weight management, IBS, gut health, diabetes, cancer and healthy eating.\n View Details for Caroline Hill",
            "url": "https://www.facebook.com/carolinehillnutrition"
        },
        {
            "name": "Claire Oldale",
            "title": "BSc (Hons) RD",
            "bio": "I have over 20 years' experience in Dietetics and I specialise in the management of IBS symptoms using the low FODMAP diet approach. I conduct face to face consultations or via Skype/Facetime/WhatsApp.\nUsually only 2 consultations are necessary and over 75% of IBS sufferers find improvement with the low FODMAP diet.\n View Details for Debra Thomas",
            "url": "https://www.facebook.com/FODMAPsCardiff"
        },
        {
            "name": "Jo Robinson",
            "title": "BSc (Hons) RD, PGcert Sports & Exercise Nutrition, Counterweight Plus Practitioner, Fodmap trained at KCL",
            "bio": "I have over 25 years of clinical experience gained from working in both the NHS and private sector. By always providing the most up to date and evidence based advice clients can be confident in receiving relevant information in a relaxed and professional environment. Key specialist areas include gastroenterology, nutritional support and weight management.\n View Details for Dawn Goudge"
        },
        {
            "name": "Tanya Thomas",
            "title": "BSc (Hons) RD",
            "bio": "I have over 25 years of clinical experience gained from working in both the NHS and private sector. By always providing the most up to date and evidence based advice clients can be confident in receiving relevant information in a relaxed and professional environment. Key specialist areas include gastroenterology, nutritional support and weight management.\n View Details for Dawn R. Goudge"
        },
        {
            "name": "Katherine Kimber",
            "title": "BSc., MSc., RD",
            "bio": "I have worked across a wide range of clinical, academic and research contexts and within a large number of NHS trusts. I have initiated research and audit projects, produced local guidelines and published extensively. I held a CQC special advisory role in nutrition from 2012-18 and have significant medico-legal experience. I have also undertaken independent dietetic service reviews and other trouble-shooting and reorganisation roles.\n View Details for Lynn Harbottle"
        },
        {
            "name": "Sandeepa Soni",
            "title": "PGDip (Nutrition and Dietetics), BSC(Hons) Biomedical Science",
            "bio": "I have worked for over 13 years in the NHS as a senior dietitian; in a hospital setting but mainly working at GP surgeries in clinics and giving talks to groups of patients.  I have worked with clients around; diabetes, heart disease, cancer, PCOS, IBS, coeliac disease, malnutrition and weight management.\n\nI have also worked with the military and their families in the Ascention Island and for MEND (a healthy eating and lifestyle group for overweight children). I have also run an after school cookery club for primary school children.\n\nI am now working in private practice. I can see clients face to face in private consultations, give talks to groups and run workshops or cookery sessions for adults or children.  I have set up weight loss and healthy eating groups to support clients to identify barriers to weight loss and create practical plans to suit individuals and their lifestyles.  I use cognitive behaviour therapy and motivational techniques to help achieve and maintain goals.\n View Details for Jenny Stevens",
            "url": "https://facebook.com/jennydietitian"
        },
        {
            "name": "Angeline Taylor",
            "title": "BSc Hons Dietetics, HCPC Registered Dietitian, Cert Ed",
            "bio": "I have worked for the NHS for over 10 years in various areas of dietetics. I currently work part time freelance and part time for the NHS.\n\nI am confident that I can help patients with various conditions. Please call to discuss. \n\nI have been involved in media tv programmes, such as, ITVs ‘Tonight’ and I have written articles for magazines.\n View Details for Sandra Tyrrell"
        },
        {
            "name": "Lesley Reid",
            "title": "Bsc Hons Dietetics",
            "bio": "I help baby & toddler brands, by giving them my time and expertise to help them make the right decisions when it comes to food and nutrition, to enhance their credibility and grow trust from their customers, by being part of their team discussions offering nutrition and public health expertise (what mum's actually want) when developing new products.\nBy communicating with their customers via content on food, nutrition & feeding (website copy, video's, social media, guest speaking)\nBy assessing their current products and working with them to improve them to give them my 'nutritionist approved' seal of approval.\nBy ghostwriting books, recipes, scripts for personal brands to deliver.\nBy educating their staff on nutrition either for themselves (corporate wellness) or to provide a better understanding of their target market.\nClients have included: Hovis, Annabel Karmel, Tommee Tippee, Plum Baby, Mother & Baby, Zoono, Hungry Monsters Caterers, Dinoshakes, Nature & Nurture, Tidy Tot  & Rachels\n View Details for Sarah Almond Bushell",
            "url": "http://facebook.com/feedingbabies"
        },
        {
            "name": "Marie Skerry",
            "title": "BSc (Honours) in Nutrition and Dietetics from The University of Surrey and Post Graduate Certificate in Diabetes from the University of Surrey Roehampton",
            "bio": "I offer\n- individual consultations for various health conditions\n- nutrition consultancy service for food business and brands \n- educational workshops \n- project management services for charities\n\nAll based in Brighton, Hove, Portslade and beyond\n View Details for Louise Symington",
            "url": "https://www.facebook.com/thesustainabledietitian/"
        },
        {
            "name": "Rochez O’Grady",
            "title": "BSc (Hons) Dietetics, Advanced Translational Nutrigenomics (Centre Translational Genomics), Mindful eating for Disordered Eating",
            "bio": "I offer 1-2-1 consultations delivered online. This works really well as you can still be face to face with me - but from the comfort of your home at a time to suit you. Packages vary from one off consultations to 3-month options offering ongoing support. Occasionally it may be necessary for me to have a quick chat with you before you book in to check I can support you with your goals. You can also book a free 10-minute call with me before booking.  Please contact me for a chat about how I can help.\n View Details for Laura Tilt",
            "url": "https://www.facebook.com/TiltNutrition/"
        },
        {
            "name": "Charlotte Foster",
            "title": "First Class BSc (Hons) Nutrition & MSc Dietetics, RD.",
            "bio": "I offer professional nutritional advice for corporate events and businesses interested in improving the health of their staff through talks, one to one consultations or workshops. Research has shown that nutrition related diseases such as obesity, diabetes and cancer,  high blood pressure and heart disease  can cause losses in productivity in employed people. Offering your staff the opportunity to improve their health through professional nutrition mentoring can significantly improve the health and productivity of your staff and therefore prevent overall losses for your company. \n\nI also work with any company to plan and nutritionally analyse menu's for specific medical conditions that require specific diets.\n\nI'm available for writing articles and blogs.\n View Details for Judith Calvin",
            "url": "https://facebook.com/healthisgoodfood"
        },
        {
            "name": "James Jackson",
            "title": "Postgraduate Diploma (PgDip) Dietetics",
            "bio": "I pride myself in detail oriented and evidence-based work and deliver on-time to a high standard. My enthusiasm and creativity drive me to produce excellent work. I am excited to hear about any projects you would like Dietetic assistance with.\n View Details for Christine O'Brien"
        },
        {
            "name": "Mairi Huntly",
            "title": "BSc Hons Nutrition and Dietetics",
            "bio": "I provide advice for a wide range of clinical conditions with specialist interest areas in Cancer (before, during and after treatment), and Gut Health (e.g. IBS)\nwww.greenlightnutrition.co.uk\nwww.theguthealthclinic.com\n View Details for Jo Cunningham",
            "url": "http://www.facebook.com/greenlightnutritionltd"
        },
        {
            "name": "Talia Cecchele",
            "title": "BND (Class 1 Honours)",
            "bio": "I provide my clients with evidence based nutritional information and advice, equipping them with the knowledge, skills and confidence to make food choices that suit their individual needs. Several years of clinical experience, study days and the completion of additional courses, has provided me with the nutritional expertise and behaviour change skills to help …\n\nHannah Dobson\nRead More »\n\n\nView Details for Hannah Dobson"
        },
        {
            "name": "Hannah Whittaker",
            "title": "BSc Community Nutrition & PgDip Nutrition and Dietetics",
            "bio": "I provide specialist intuitive eating coaching for women to reclaim confidence in their body, connect with their hunger and fullness and manage emotional or binge eating.\n\nAs a Certified Intuitive Eating Counsellor I am highly specialised in diving into all aspects of the eating experience so you can improve your health AND create a peaceful relationship with eating.\n View Details for Emma Townsin",
            "url": "https://www.facebook.com/groups/foodlifefreedom"
        },
        {
            "name": "Joleen Sutcliffe",
            "title": "BSc (Honours) Dietetics (1st class)",
            "bio": "I qualified as a Dietitian in 1994 and have 25 years experience covering many areas of nutrition.  My main areas of interests include child nutrition (including SPD, Autism and ADHD in all ages), women’s health and disordered eating / eating behaviour. I also have experience in oncology (cancer) , HIV, …\n\nSamantha (Sam) Perkins\nRead More »\n\n\nView Details for Samantha (Sam) Perkins",
            "url": "https://www.facebook.com/happyeatersuk/"
        },
        {
            "name": "Kirsty Bamping",
            "title": "MNutr RD",
            "bio": "I qualified as a dietitian in 2009 and have been passionate about helping people ever since. My key interests involve healthy eating for a healthy weight in both adults and young people, diabetes, vegetarian and vegan diets, as well as weaning and maternal health.  From my what I have learnt …\n\nRachael Hunter\nRead More »\n\n\nView Details for Rachael Hunter"
        },
        {
            "name": "Emma Jones",
            "title": "Nutrition and Dietetics BSc Honours",
            "bio": "I qualified as a dietitian in 2015 and I have worked for the NHS mostly in hospitals, but also in the community and GP surgeries. I also work on a freelance basis. During this time I have gained a breath of experience in specialist settings such as oncology, gastrointestinal and …\n\nMandel Annika\nRead More »\n\n\nView Details for Mandel Annika"
        },
        {
            "name": "Lisa Gilbert",
            "title": "BSc (Hons) RD",
            "bio": "I qualified as a dietitian in South Africa (BSc Med (Hons) Nutrition and Dietetics) and am registered with HCPC (DT27547). I worked in London as a paediatric dietitian for 5 years, and am now Essex based.   My areas of special interest include: premature infant nutrition, weaning, enteral feeding and …\n\nLiesl Silbernagl\nRead More »\n\n\nView Details for Liesl Silbernagl"
        },
        {
            "name": "Debra Williams",
            "title": "BSc (Hons) RD",
            "bio": "I qualified as a dietitian way back in 1996. I have had an extremely varied career with experience in NHS acute and community settings, senior management of multi disciplinary services in a community foundation NHS trust;  and as a scientific lead in the medical nutrition industry. My areas of interest …\n\nShola Oladipo\nRead More »\n\n\nView Details for Shola Oladipo",
            "url": "https://www.facebook.com/foodforpurpose/"
        },
        {
            "name": "Sarah Almond Bushell",
            "title": "MPhil, BSc (Hons) RD",
            "bio": "I qualified in 2009 with a Post Graduate Diploma in Dietetics, and initially worked on the wards at Epsom General Hospital.  I have since worked in various community settings with a focus on nutritional care of the elderly and general dietetic clinics seeing a wide of range of clinical cases, …\n\nHayley Fowler\nRead More »\n\n\nView Details for Hayley Fowler"
        },
        {
            "name": "Daniel Alcedo",
            "title": "BSc (Honors) RD",
            "bio": "I run a gut health clinic and treat clients who present with numerous gut conditions and symptoms.  I also help clients to boost their overall gut health.  I have a history of coeliac disease and IBS, so for me, gut health is an area that I am particularly passionate about and I understand just how debilitating it can be.   Contact me for further information via my website: www.jenniferryan.co.uk\n View Details for Jennifer Ryan",
            "url": "https://www.facebook.com/jennifer.ryan.dietitian"
        },
        {
            "name": "Joanna Injore",
            "title": "BSc Honours Nutrition and Dietetics and Pre-Master of Clinical Research",
            "bio": "I run a private clinic in West Bridgford, Nottingham.\nI offer online video and telephone appointments. \nI offer friendly, expert, personalised nutrition services.\n View Details for Gabriella Goodchild",
            "url": "https://www.facebook.com/healthfuldietitian/"
        },
        {
            "name": "Paula Hallam",
            "title": "B.Sc (Med)(Hons) RD",
            "bio": "I want every patient to feel heard and cared for.  Knowing that the path to achieving their health goals is as unique as they are, and that it takes a joint effort to piece the puzzle together.  My areas of expertise include gut health, food intolerances, diabetes and other blood …\n\nCarin Hume\nRead More »\n\n\nView Details for Carin Hume"
        },
        {
            "name": "Soraya David-Pineda",
            "title": "BSc (Hons) Nutrition & Dieteitcs, Pg Cert Sports Nutrition, IBS FODMAP trained",
            "bio": "I'm a Registered Dietitian with extensive experience in weight management with clients across Europe and the UK.\nI believe the first step to a healthier you starts with understanding your own body composition and then working together to define how best to enhance it.\nI will give you the tools to access that healthier version of yourself you always wanted.\nYou will get a flexible plan tailored just for you along with the nutritional education you need to follow it successfully.\nI am FODMAP trained by King's College in London and HCPC registered.\n View Details for Daniel Alcedo"
        },
        {
            "name": "Josie Porter",
            "title": "BSc (Hons) Dietetics; MSc Dietetics",
            "bio": "I'm a skilled registered paediatric dietitian with over 13 years experience working within the NHS for leading Trusts such as the Royal Free London and Oxford University Hospitals Foundation Trust. I've worked in both hospital and community settings and treated an array of complex conditions.  My speciality is paediatrics and my passion is for helping children and their families.  As a mother of three young children I only know too well the difficulties of providing children with a healthy diet whilst juggling the pressures of a busy family life.  Based in Oxfordshire, I provide both group and one to one consultations.  I qualified with a First Class Hons Degree in Food Science and Nutrition and Human Biology and went on to gain a Post Graduate Diploma in Dietetics.  I am registered with the HCPC, and a full member of the BDA and sub groups including the paediatric, allergy and freelance groups.\n View Details for Joanna Lenz",
            "url": "https://facebook.com/jolenzdietetics"
        },
        {
            "name": "Maureen Moerbeck",
            "title": "BSc Nutrition & Dietetics (Hons), PG Dip Sports Nutrition, PG Cert Pub Health, RD",
            "bio": "If you are looking to lose weight, need healthy eating advice or have an illness and require expert nutritional advice, I can help you. My name is Rania and I am a qualified and experienced registered dietitian and nutritionist based in London and Essex. Knowing which foods to eat is difficult enough, with all the conflicting information out there. If you are trying to manage your weight or you have a serious illness, it is even harder!\n\nAs a trained dietitian I use an evidence-based approach to support you in reaching your goals. My areas of expertise include oncology/heamatology, diabetes and weight management in addition to general health and wellbeing.  Do get in touch if you feel that I can help you with any of the above!\n View Details for Rania Salman"
        },
        {
            "name": "Emma Townsin",
            "title": "Master of Dietetics (MSc); Certified Intuitive Eating Counsellor",
            "bio": "In addition to dietetic consultations, Talia is provides services such as corporate workshops, cooking demonstrations, recipe creation, brand collaboration and freelance writing.\n View Details for Talia Cecchele"
        },
        {
            "name": "Angharad Banner",
            "title": "BSc (Hons) Nutrition, PG Dip Dietetics, MBDA, RD",
            "bio": "In addition to private practice, I provide nutrition consulting services to companies and organisations. I am happy to speak with the media and travel around the country providing corporate wellness courses, workshops and lectures.\n View Details for Dalia Maori",
            "url": "https://www.facebook.com/daliamaorinutrition/"
        },
        {
            "name": "Jen Credicott",
            "title": "BSc Honors Nutrition and Dietetics",
            "bio": "Interpreta Nutrition provides consultancy services to the food industry and public sector organisations, specialising in the infant, early years and dietetic foods sectors. Support research, product development and marketing processes where a nutrition science or regulatory input is required.\n View Details for Helen Rose"
        },
        {
            "name": "Roslyn Gray",
            "title": "Bsc Honours Registered Dietitian",
            "bio": "Isabelle is a registered dietitian, passionate about helping people reaching their health goals through balanced nutrition. Isabelle has over 15 years experience as a clinical dietitian, having specialised in diabetes, weight management and IBS. Having worked successfully with individuals and groups in a variety of settings, to help improve their …\n\nIsabelle Fry\nRead More »\n\n\nView Details for Isabelle Fry",
            "url": "https://www.facebook.com/DietMattersDietitian/"
        },
        {
            "name": "Dawn Goudge",
            "title": "BSc(Hons) Nutrition and Dietetics, RD",
            "bio": "I’m a registered dietitian with over 30 years’ experience in a variety of settings. I worked for many years in NHS hospitals and the community before moving to a career in academia as Senior Lecturer in Nutrition and Public Health at the University of Bristol. I now work freelance with …\n\nSue Baic\nRead More »\n\n\nView Details for Sue Baic"
        },
        {
            "name": "Nichola Williams",
            "title": "MNutr",
            "bio": "I’m an experienced dietitian, specialising in Irritable Bowel Syndrome (IBS), weight management and nutrition for sport. Through one to one consultations, I can tailor nutritional advice to support individuals improve their health and wellbeing.\n View Details for Rachel Zibe",
            "url": "https://en-gb.facebook.com/rznutrition/"
        },
        {
            "name": "Elizabeth Owen",
            "title": "MNutr RD",
            "bio": "I’m Annabel and I live in Mallorca. After 14 years working within the wonderful NHS for Imperial College Healthcare NHS Trust in London and Brighton and Sussex University Hospitals, I now offer private consultations (currently via Zoom only) and would be delighted to discuss your needs via a free 15 …\n\nAnnabel Alder\nRead More »\n\n\nView Details for Annabel Alder"
        },
        {
            "name": "Samantha Milner",
            "title": "BSc (Hons), PGDip, RD, PGCE",
            "bio": "Jacqueline is a Registered Dietitian, child nutritionist and founder of Nutritional, a private family nutrition clinic.  Jacqueline offers remote consultations, individual and group sessions in Surrey on a wide range of child nutrition areas.  Together with NHS experience in acute London hospitals, Jacqueline has worked as a Specialist CAMHS Dietitian, working alongside teenagers with learning disability, autism, ADHD, eating disorders and disordered eating associated with mental health challenges.  A role that utilised a previous degree in psychology.  \n\nJacqueline uses a whole family approach, working with parents and children of all ages from babies to adolescents to tackle food-related issues with positive, practical and achievable plans that promote both physical and mental health.  This means taking time to understand your individual needs and lifestyle and using behaviour change approaches to create lasting habits.  \n View Details for Jacqueline Galanty"
        },
        {
            "name": "Lucy Jackman",
            "title": "BSc Hon Dietetics",
            "bio": "Jean is a West Yorkshire-based Registered Dietitian with extensive dietetic experience gained in both the National Health Service (NHS) and private sectors. Jean specialises in one-to-one personalised consultations Clients will be provided with in-depth, personalised and high-quality dietary advice. Clients can be advised on a range of nutritional areas including: …\n\nJean Sullivan\nRead More »\n\n\nView Details for Jean Sullivan"
        },
        {
            "name": "Lucy Jackman",
            "title": "BSc Hon Dietetics",
            "bio": "Jeanette is a specialist gastroenterology dietitian and her areas of research and expertise focus on irritable bowel syndrome, small intestinal bacterial overgrowth, food allergies/intolerances and probiotics She also works closely with patients who have inflammatory bowel disease, coeliac disease and liver disease.  \n\nJeanette set up Vie Nutrition to provide a unique service focusing on bowel health and function.  We are able to provide an in-depth assessment and fully understand the clinical, social and nutritional factors which affect bowel function.  This enables us to focus on the key factors which affect bowel health and thereby provide the right advice and dietary management.  We can also undertake testing for food allergies and for SIBO (small intestinal bacterial overgrowth).\n\nWe also provide a specialist service for Diabetes and Weight management which is run by our experienced and award winning lead dietitian in this field.\n View Details for Jeanette Starkey"
        },
        {
            "name": "Laura Clark",
            "title": "BSc (Hons) PgCert",
            "bio": "Jennifer has a wealth of experience working in media.  She wrote for the Healthy Food Guide magazine for many years both in the UK and New Zealand.  She is a media spokesperson for the the British Dietetic Association.  \nShe has experience of TV, both live and pre-recorded, on and off-screen.\nShe has also written articles for trade and consumer press and regularly commented on many aspects of nutrition in a broad range of media.  She has additionally peer-reviewed two high profile nutrition books.\n View Details for Jennifer Low",
            "url": "https://www.facebook.com/JLNutritionClinic/?ref=tn_tnmn"
        },
        {
            "name": "Ana Etxeberria",
            "title": "BSc Hons Nutrition & Dietetics; BA Hons Psychology; Postgraduate Certificate in Sports & Exercise Nutrition",
            "bio": "Jill Scott BSc RD MBDA is a Registered Dietitian and Nutrition Consultant who combines her freelance career with a part time with Macmillan Cancer Support, as a Development Lead for people living with cancer. With over 30 years’ experience in the fields of nutrition, health and wellbeing, Jill works with a range of organisations within the statutory, private and voluntary sectors in the design and delivery of training programmes, including trainer training, and resource development. Her particular area of interest and expertise is healthy weight management and lifestyle behaviour change throughout the lifespan.\n View Details for Jill Scott"
        },
        {
            "name": "Julia Pairpoint",
            "title": "BSc (Hons) (RD)",
            "bio": "Joana holds a Masters' degree in Clinical Nutrition and possesses a vast experience on weight management and food services. She is the founder of Your Diet Advice, and online nutrition clinic and blog.\n View Details for Joana Jardim",
            "url": "https://www.facebook.com/yourdietadvice/"
        },
        {
            "name": "Ruth Conroy",
            "title": "BSc Hons, SRD, Specialist Dietitian",
            "bio": "Joanna Injore is a registered Dietitian with over 16 years experience of providing expert evidence-based nutrition advice. Joanna offers flexible 1-2-1 appointments to suit your needs in a range of areas from healthy eating, family nutrition to specific medical conditions such as cancer, cardiovascular health or weight management. In addition …\n\nJoanna Injore\nRead More »\n\n\nView Details for Joanna Injore",
            "url": "https://www.facebook.com/JINutrition"
        },
        {
            "name": "Rachel Stentiford",
            "title": "BSc (Nutrition), Post Grad (Dietetics)",
            "bio": "Josie is a registered dietitian, specialising in weight management, hormone-driven conditions and irritable bowel syndrome (IBS) management. She currently works as a specialist in bariatric and metabolic surgery in central London, both clinically and in research. In her role, she supports individuals to improve various markers of health and in reaching their …\n\nJosie Porter\nRead More »\n\n\nView Details for Josie Porter"
        },
        {
            "name": "Gabriella Goodchild",
            "title": "Masters of Nutrition (Dietetics)",
            "bio": "Judy is a Registered Dietitian with 10 years clinical experience in the NHS, her recent post included developing the local cow’s milk allergy pathway, supporting children with learning disabilities and eating disorders. She also ran a specialist gastroenterology clinic and busy general clinic treating different nutrition problems including food allergy …\n\nJudith Paterson\nRead More »\n\n\nView Details for Judith Paterson",
            "url": "https://www.facebook.com/Judicious.Nutrition"
        },
        {
            "name": "Liane Reeves",
            "title": "BSc (Hons) Nutrition, MSc Allergy, RD",
            "bio": "Julia is a state registered dietitian with over 20 years clinical experience in the NHS. She currently specialises in diabetes and has extensive knowledge in her field. She is a trained DAFNE and DESMOND educator and is greatly involved with running courses to benefit diabetes such as carbohydrate counting, insulin start programmes, healthy eating for gestational diabetes and freestyle Libre guidance. Other areas of interest are heart health, weight management and general healthy eating for prevention, including mindful eating and behavioural and lifestyle changes. Julia is passionate about her work and dedicated to support and motivate you to make changes.\n View Details for Julia Pairpoint"
        },
        {
            "name": "Debra Thomas",
            "title": "BSc (Open); BSc (Hons) Registered Dietitian",
            "bio": "Karen is an experienced HPCP registered dietitian, and currently works as a Senior Teaching Fellow at Warwick Medical School. She is Course Director for the Certificate in Diabetes Care course and involved in the Masters degree programme. These courses are designed for health care professionals (GP’s, practice nurses, pharmacists and …\n\nKaren Jones\nRead More »\n\n\nView Details for Karen Jones"
        },
        {
            "name": "Nicole Croft-O’Halloran",
            "title": "BSc(Honors) RD",
            "bio": "Kate Costello is a registered dietitian with a wide breadth of experience in both adult and children’s nutrition. Kate set up the Inspire Dietetic Consultancy, her private practice, after many years of working in the NHS. She has worked in a variety of nutritional and dietetic roles throughout her career …\n\nkate costello\nRead More »\n\n\nView Details for kate costello"
        },
        {
            "name": "Anne Wright",
            "title": "BSc, Grad Dip Ed, Grad Dip Nutr&Diet, MBDA, FHEA",
            "bio": "KATE TWINE \nBSc (Hons), PGDipDiet, RD, DMS, HCPC Registered, MBDA\nRegistered Dietitian and Nutrition Consultant.  \n\nKate is a dietitian with more than 30 years’ experience in both clinical practice and food industry.\n View Details for Kate Twine"
        },
        {
            "name": "Lynn Harbottle",
            "title": "BSc(HONS) Home Economics, PG Diploma in Dietetics, MSc Medical Anthropology, PhD Nutritional Anthropology, Diploma in Management Studie",
            "bio": "Kate gained a BSc hons in dietetics in 1984 at Leeds Polytechnic  She then trained as a teacher and gained a post graduate diploma in health promotion, and worked in Further education, and as a Health promotion specialist within  the National Health Service.  She returned to dietetics in 2002. In 2007 she set up a …\n\nKatharine Sheldon\nRead More »\n\n\nView Details for Katharine Sheldon"
        },
        {
            "name": "Nicole Lackenby",
            "title": "BSc PGDip (Hons) RD",
            "bio": "Katherine is a Registered Dietitian, Certified Intuitive Eating Counsellor with an NHS background. She holds a Masters in Clinical Research with nearly just under 8yrs clinical experience. \n\nShe founded Nude Nutrition in 2017 and is on a mission to help people break away from the food rules and to eat with happiness! \n\nKatherine is available to; speak at panels events, be a guest on podcasts, run workshops at festivals, contribute to or write articles on various nutrition-related topics, run corporate nutrition talks, educate healthcare professionals on weight stigma, and non-diet approaches to nutrition (she has guest lectured at Bournemouth University on this topic). Her portfolio and info for hire are available here: https://nudenutritionrd.com/hire-me/\n View Details for Katherine Kimber",
            "url": "https://www.facebook.com/ndenutritionrd/"
        },
        {
            "name": "Paula Day",
            "title": "BSc Human Nutrition & Dietetic, MSc Public Health",
            "bio": "Kathy’s main focus is public health nutrition with interest in supporting healthy eating and activity to promote future health – particularly for pregnancy and early years. She has worked in the NHS in Sure Start settings and many community settings along with freelance work since 1983.  But works completely freelance …\n\nKathy Cowbrough\nRead More »\n\n\nView Details for Kathy Cowbrough"
        },
        {
            "name": "Aleeza Rosenberg",
            "title": "BSc (Hons) MSc (UCL) RD MBDA",
            "bio": "Kattya qualified as a registered dietitian in 2009. Kattya is bilingual, and is able to conduct interviews and assessments in Spanish. She began her dietetic career in the NHS, covering acute medicine, elderly care, gastrointestinal (GI) ,  Human immunodeficiency virus (HIV), surgical, palliative care, Epidermolysis Bullosa (EB) and dermatological,  diabetes, …\n\nKattya Mayre-Chilton\nRead More »\n\n\nView Details for Kattya Mayre-Chilton"
        },
        {
            "name": "Maeve Hanan",
            "title": "BSc (Hons) Dietetics",
            "bio": "Kids Feeding Team work hard to improve the health of babies and children by providing a patient-centred approach from a passionate, approachable and knowledgeable team.\nWe provide babies and children with immediate access to a specialist multidisciplinary feeding team service.\nOur vision is to improve the health of babies and children by providing parents with immediate access to an evidence-based multidisciplinary feeding team service.\nNiamh is our committed Specialist Paediatric Dietitian who has experience in both the NHS and private sectors. She understands the complex needs of each individual child and their family to provide patient centred care which is results-focused, evidence based and personable.\nAt Kids Feeding Team we provide a range of services to improve the health of babies and children, check out our website for further information at www.kidsfeedingteam.co.uk\n View Details for Niamh Gilligan",
            "url": "https://www.facebook.com/kidsfeedingteam/"
        },
        {
            "name": "Angie Jefferson",
            "title": "BSc (HONs) RD RNutr",
            "bio": "Kirsten Jackson is a consultant gastroenterology dietitian specialising in IBS management.\n View Details for Kirsten Jackson",
            "url": "https://www.facebook.com/thefoodtreatmentclinic/?ref=aymt_homepage_panel"
        },
        {
            "name": "Tai Ibitoye",
            "title": "BSc (Hons), PGDip, MSc, RD",
            "bio": "Kirsty is registered dietitian. She can provide a personalised nutrition service and offer tailored dietary advice based on scientific evidence and national guidelines. Kirsty will recognise lifestyle, food preferences and health and fitness goals to enable her clients to optimise their health. She will always go the extra mile to help her clients to achieve their goals.\n View Details for Kirsty Bamping"
        },
        {
            "name": "Shola Oladipo",
            "title": "BSc Hons Nutrition and Dietetics",
            "bio": "Kylie sees private practice clients at Spire Gatwick Park Hospital.  During your appointment, Kylie will take a detailed history and a dietary treatment plan will be discussed. Personalised goals will be set. Kylie will provide evidence-based advice which will be tailored to your individual circumstances. Kylie can provide dietary advice for …\n\nKylie Bishop\nRead More »\n\n\nView Details for Kylie Bishop"
        },
        {
            "name": "moya Patricia Dorothy white",
            "title": "BSc Honours in Nutrition & Dietetics. Masters in Sports Nutrition Registered Dietitian",
            "bio": "Lesley Reid Nutritional Health was set up in 2013 as a freelance dietetic company by Lesley Reid, who has over 17 years experience as Dietitian.\n\nHaving started her career at the Queen Elizabeth Hospital in Gateshead back in 2000, within 2 years Lesley had taken up a post in the Glasgow Royal Infirmary, working mainly with Maternal health and helping mums with their nutrition in pregnancy.\n\nIn 2009 Lesley moved into Community Dietetic where she worked for 8 years.  She has worked in Public health roles for NHS 24 and In January 2017, she moved from the NHS to working full time as a  Freelance Dietitian across Glasgow and throughout Scotland.\n\nRecent qualifications include:\n\nCounterweight and Counterweight Plus training (licensed practitioner)\nQualification from Kings College London in Low Fodmap diet in Functional gastrointestinal disorders.\nBDA Professional development award in Behavioural Change\nCertificate in Sports Nutrition\nWith a Bsc (Hons) in Nutrition and Dietetics from Glasgow\n View Details for Lesley Reid",
            "url": "https://www.facebook.com/lesleyreiddietitian/"
        },
        {
            "name": "Cordula Henggeler",
            "title": "MHSc in Nutrition and Dietetics",
            "bio": "Liane specialises in helping teenagers and adults with Irritable Bowel Syndrome and other gastro-intestinal conditions and diagnosing and managing food allergies and intolerances. She has over 20 years’ experience working in the NHS where she continues to work part-time as Adult Allergy Specialist Dietitian as well as run her private …\n\nLiane Reeves\nRead More »\n\n\nView Details for Liane Reeves",
            "url": "https://www.facebook.com/Liane.Reeves.Registered.Dietitian?_rdr=p"
        },
        {
            "name": "Kirulagini Sivamathavan",
            "title": "BSc (Hons), Reading for Master's",
            "bio": "Lisa Bailey, the founder of Spoonit®, has 15 years of experience as a Dietitian and currently works within the NHS as part of a weight management service in Wales.\n View Details for Lisa Bailey",
            "url": "https://www.facebook.com/spoonituk"
        },
        {
            "name": "Erin Adams",
            "title": "Bachelor of Human Nutrition; Master of Dietetics",
            "bio": "Lisa Gilbert has worked as a dietitian in the NHS for 12 years since qualifying in 2008 from Glasgow Caledonian University. Having worked in an acute setting in Greater Glasgow and Clyde  for 8 years across various Specialities (Including Gastroenterology, Surgery and Critical Care, Neurology, Blood Borne Viruses, Infectious Disease, …\n\nLisa Gilbert\nRead More »\n\n\nView Details for Lisa Gilbert"
        },
        {
            "name": "Claire Fudge",
            "title": "Bsc Hons RD, Adv.Dip, PgCert",
            "bio": "Lisa Waddell is Director of her private business; Food Allergy Nottingham Service Ltd (FANS) and also works part time for the NHS as lead community paediatric dietitian.  She is an expert in paediatric food allergy and has over 20 years  experience helping families identify whether their infant/ young child is suffering from food allergy or other feeding related problem.\n View Details for Lisa Waddell",
            "url": "https://www.facebook.com/allergydietitian"
        },
        {
            "name": "Tabassum Kabeer",
            "title": "BSC Nutrition & Dietetics",
            "bio": "Liz is an experienced dietitian who can help you get to grips with the why, what and how of healthy eating! If you want to eat in a healthier way, but you don’t know where to start, focusing on what you CAN eat for better health and wellbeing (instead of …\n\nLiz Fleming\nRead More »\n\n\nView Details for Liz Fleming",
            "url": "https://facebook.com/thebewellspace"
        },
        {
            "name": "Tamsin Kivi",
            "title": "BS’c honors in Dietetics",
            "bio": "Louise Bula is a Registered Dietitian with the Health & Care Professions Council (HCPC) and a member of the British Dietetic Association (BDA). She obtained a bachelor’s degree with honours (BSc hons) in Nutrition and Food Science from the University of Reading and a postgraduate diploma (PgDip) in Dietetics from …\n\nLouise Bula\nRead More »\n\n\nView Details for Louise Bula"
        },
        {
            "name": "Jenaed Brodell",
            "title": "Med Sci Hons, RD & B.Sports Sci",
            "bio": "Lucy is a passionate and enthusiastic Dietitian, specialising in infant and child nutrition. She has over 10 years paediatric experience, working in the NHS and private sector including;  specialist mental health settings, community practice, special schools and large teaching hospitals.  Her current NHS role is based at Birmingham Children’s Hospital. …\n\nLucy Upton\nRead More »\n\n\nView Details for Lucy Upton"
        },
        {
            "name": "Sandra Tyrrell",
            "title": "BSc Dietitian",
            "bio": "Lucy Perrow (nee Turnbull) is an award winning weight management dietitian, who has worked in the field for nearly 20 years in both the UK and the USA. She specialises in weight management and offers one-to-one consultations face-to-face or online. She also offers a 12 week interactive online programme to …\n\nLucy Perrow\nRead More »\n\n\nView Details for Lucy Perrow"
        },
        {
            "name": "Catherine Rabess",
            "title": "BSc (Hons) RD",
            "bio": "Lucy trained in Cardiff and qualified as a registered dietitian in 2004.  Lucy combines full-time NHS employment as a specialist gastroenterology dietitian with private practice and freelance nutrition consultancy work. Lucy is experienced in the dietary management of bowel conditions including Irritable Bowel Syndrome (IBS) and is the lead specialist …\n\nLucy Pritchard\nRead More »\n\n\nView Details for Lucy Pritchard"
        },
        {
            "name": "Helen Phadnis",
            "title": "RD BSc MSc PgCert MBDA",
            "bio": "Lynda is a HCPC registered Freelance Dietitian and a full member of the British Dietetic Association.  Lynda has 17 years dietetic experience in the NHS working in many areas with both children and adults.  She has specialised in paediatric nutrition for 15 years.  Her areas of clinical expertise include food …\n\nLynda Rigley\nRead More »\n\n\nView Details for Lynda Rigley"
        },
        {
            "name": "Isabel Anderson",
            "title": "BSc Nutrition and Dietetics. Post Graduate Certificate Applied Sports Nutrition",
            "bio": "Maeve Hanan is a Consultant Dietitian and the founder of Dietetically Speaking - a nutrition communication and consultancy company that promotes accessible, no-nonsense messages about nutrition. DieteticallySpeaking.com has had over 350,000 visitors from all over the world and has a combined social media following of over 45,000 people. She is passionate about spreading evidence-based nutrition messages which promote long-term health and a healthy relationship with food. Maeve is also the co-founder of Nutrimote.com which supports Nutritional Professionals who are interested in remote working and digital solutions. \n View Details for Maeve Hanan",
            "url": "https://www.facebook.com/DieteticallySpeaking/"
        },
        {
            "name": "Sarah Elder",
            "title": "RD Msc PGDip BSc",
            "bio": "Marcela is a dietitian and award winning nutritionist with over 10 years experience working for top NHS hospitals and the private sector.  Her areas of expertise include women’s health, prevention and dietary management of life-style related diseases. Marcela has a strong academic background and has published in respected peer reviewed …\n\nMarcela Fiuza\nRead More »\n\n\nView Details for Marcela Fiuza"
        },
        {
            "name": "Rachel Redman",
            "title": "BSc (Honours) RD",
            "bio": "Maureen has a BSc honours degree in Nutrition & Dietetics, a Graduate Diploma in Sports Nutrition with the International Olympic Committee and a Graduate Certificate in Public Health. She has over 15 years of clinical experience in both the UK and Australia having worked within the NHS and in her …\n\nMaureen Moerbeck\nRead More »\n\n\nView Details for Maureen Moerbeck",
            "url": "https://facebook.com/mindfulnutritionpractice"
        },
        {
            "name": "Jacqueline wilson",
            "title": "BSC ( Hons) Nutrition, Dietetics",
            "bio": "Mei Wan - FdSc, BSc (Honors), RD, MBDA Mei is a dedicated and caring Dietitian. A graduate from The University of Surrey, Mei has worked as a Specialist Project Lead Dietitian for both adult and childhood obesity management. Mei has also worked as a Senior Dietitian and Diabetes Specialist Dietitian in digital health care where she helped patients to prevent type 2 diabetes and supported individuals with type 2 diabetes. Mei's passion is to help empower people to go above and beyond their health goals. Mei continues to work within the NHS and provides consultancy work for private healthcare alongside her private practice and freelance dietetic services. In November 2020, Mei was promoted to lead on NHS England's Low Calorie Diet pilot programme to help patients to achieve diabetes remission. She has an established background for creating practical and sustainable solutions for healthier and happier lives.\n View Details for Mei Wan",
            "url": "https://www.facebook.com/dietitian.mei"
        },
        {
            "name": "Sarah Roberts",
            "title": "Bsc(Hons) Nutrition and Dietetics , Registered SOS therapist (Feeding difficulties)",
            "bio": "Melinda Boyd is a US trained dietitian now credentialed in the UK. After living in Thetford, England for 3 years she has recently relocated back to the US. She is available for video conferencing/telehealth visits. Melinda spent her early years as a dietitian working in a large hospital in Las Vegas, …\n\nMelinda Boyd\nRead More »\n\n\nView Details for Melinda Boyd",
            "url": "https://www.facebook.com/InANutshellNutrition/"
        },
        {
            "name": "Catherine Nash",
            "title": "Bsc (Hons) Dietetics",
            "bio": "Michelle is a HCPC registered UK Dietitian and Nutritionist with over 15 years of experience providing evidence-based nutrition advice. Michelle has worked with clients across Freelance, NHS and private sectors, to help them prepare for and recover from surgical procedures, deal with the effects of medical treatment, or optimise their health and well-being.\n\nMichelle’s specialist interests lie predominantly in Women's Health, Weight Management and Nutrition support. She is a member of the Maternal and Fertility, Oncology, and Obesity specialist interest groups of the BDA.\n\nMichelle’s freelance consultancy MBE Nutrition, offers clients flexible 1-2-1 appointments across a variety of clinical areas.\nMichelle also offers a range of bespoke services to businesses including menu analysis, health writing and corporate wellness programmes.\n View Details for Michelle Bremang",
            "url": "https://www.facebook.com/mbenutrition"
        },
        {
            "name": "Gillian Larcombe",
            "title": "Bachelor of Nutrition & Dietetics, RD",
            "bio": "Moya is now retired\n View Details for moya Patricia Dorothy white"
        },
        {
            "name": "Laura Stewart",
            "title": "PhD, BSc in Dietetics, BA (HONS)",
            "bio": "Mrs Brenda Smith is a Registered Dietitian, who qualified from Kings College London with a Bachelor in Science in Nutrition and Dietetics in 2009.   She was awarded a Post Graduate Diploma in Allergy from Southampton University in November 2018 and qualified as a Mindful Eating Instructor from MB-EAT in 2020.  Previous …\n\nBrenda Smith\nRead More »\n\n\nView Details for Brenda Smith"
        },
        {
            "name": "Annabel Alder",
            "title": "BSc Hons Nutrition and Dietetics (1st Class), King's College London, 2005",
            "bio": "My mission is to help women who have been diagnosed with PCOS, Endometriosis, Adenomyosis or Irritable Bowel Syndrome to improve their symptoms through nutrition and assist those who are trying to conceive or are struggling with fertility and would like to explore natural ways to support their chances of conceiving a baby. I am an experienced UK Registered Dietitian with a master’s degree in nutrition and dietetics. While I have a few interests, I specifically work with women to help them understand their body and improve their long-term health through evidence-based nutrition and sustainable long term changes.\n View Details for Cordula Henggeler",
            "url": "https://www.facebook.com/womenshealthdietitian/"
        },
        {
            "name": "Nusrat Kausar",
            "title": "BSc (Hons) Dietetics, Sport and Exercise Nutrition (PG Cert), Graduate SENr registrant",
            "bio": "My name is Adriana and I am a specialised Paediatric Dietitian with over 17 years’ experience. I am from Mexico City where I studied a BSc in Nutrition and Dietetics. I came to London over 13 years ago to study a Master’s Degree in Human Nutrition at King’s College London. …\n\nAdriana Garcia Jones\nRead More »\n\n\nView Details for Adriana Garcia Jones"
        },
        {
            "name": "Claudia Ehrlicher",
            "title": "Registered Dietitian",
            "bio": "My name is Alejandra. I was born in Chile, a beautiful country in South America. I studied Nutrition and Dietetics there, and after graduating, I came to the UK to live. I lived for nearly a year in Bristol (England) and now I am based in Edinburgh (Scotland). During all …\n\nAlejandra Alarcon Navarro\nRead More »\n\n\nView Details for Alejandra Alarcon Navarro"
        },
        {
            "name": "Kirsten Jackson",
            "title": "Bsc Honours Dietetics RD PGCert mBDA",
            "bio": "My name is Anne Wright and I am a Registered Dietitian and team leader at AM Dietetics. Our small but friendly team of expert, private, Dietitians works with people and organisations to help improve their health and wellbeing by making healthy food and nutrition choices. We believe in a kind approach - helping you to feel better.\nWe can help you to prevent and manage a wide range of health conditions. Available online, from the comfort of your own home, from anywhere in UK or worldwide. (Also local services - based on the Wirral).\n View Details for Anne Wright",
            "url": "https://www.facebook.com/amdietetics"
        },
        {
            "name": "Preetpal Kainth",
            "title": "MSc, PgDip RD",
            "bio": "My name is Marcelle Glantz and I have over 20 years experience working as a Specialised Paediatric Dietitian. I have worked for over 10 years at specialist children’s hospital helping babies, toddlers, children and teenagers with special diets, tailored to their individual needs. I have expertise in the management of …\n\nMarcelle Glantz\nRead More »\n\n\nView Details for Marcelle Glantz"
        },
        {
            "name": "Helen Gardiner",
            "title": "BSc (Hons) Nutrition and Dietetics",
            "bio": "My name is Paula Hallam and I am a Paediatric Dietitian with 20 years experience, working in both the NHS and the private sector, as well as consulting to health charities and the food industry. I currently run a private practice called ‘Tiny Tots Nutrition’ with clinics based in Walton, …\n\nPaula Hallam\nRead More »\n\n\nView Details for Paula Hallam",
            "url": "https://www.facebook.com/TinyTotsNutrition/"
        },
        {
            "name": "Evelyn Toner",
            "title": "BScHons, PGCert, RD",
            "bio": "My name is Shirley Mabindisa I am your Dietitian and founder of MSM Nutrition Consultancy LTD.\n\nMy passion is to improve your quality of life through diet. I am friendly, compassionate and I believe in a person-centred approach when it comes to dietary counselling. I am confident that I can empower you to take charge of your diet and health despite of your health condition and life stage.\n\nI am registered with the Health and Care Professions Council and am also a full member of the British dietetic association.\n View Details for Makheale Shirley Mabindisa",
            "url": "https://www.facebook.com/msmnutritionuk"
        },
        {
            "name": "Paula Gallon",
            "title": "BSc (Hons) RD",
            "bio": "My Passion I love food and my passion for great ingredients led to cooking, started as a very small child helping my grandmother make cakes.  Throughout my life, I’ve always been aware of the positive, medicinal benefits that a healthy relationship with food can bring and after years of experience …\n\nHelen West\nRead More »\n\n\nView Details for Helen West"
        },
        {
            "name": "Anne Cushen",
            "title": "BSc Honours (Registered Dietitian)",
            "bio": "My specialist dietetic clinical expertise is weight loss, diabetes (both Type 1 and Type 2), pre-diabetes and digestive diseases (IBS, including Low FODMAP diets; Coeliac Disease).\n View Details for Anita Bowes"
        },
        {
            "name": "Dawn R. Goudge",
            "title": "BSc(Hons) Nutrition and Dietetics, RD",
            "bio": "Navjit has worked with a range of businesses, charities and religious groups . She has a flexible and friendly nature which aids her to develop a deep understanding of the target audience. \n\nHer knowledge of Dietetics has helped to influence communities and consumers.\n View Details for Navjt Kaur Sidhu"
        },
        {
            "name": "Victoria Mann",
            "title": "MSc Dietetics, BSc (Hons) Diet & Health",
            "bio": "Neha is a highly experienced and passionate Specialist Bariatric, Weight Management and Diabetes Dietitian working in the NHS and in the private sector. In her 10 years’ experience, she has been fortunate enough to work with many patients helping them improve their health and well-being, having worked in Birmingham, Coventry, …\n\nNeha Parekh\nRead More »\n\n\nView Details for Neha Parekh",
            "url": "https://www.facebook.com/nutritionbyneha"
        },
        {
            "name": "Karine Patel",
            "title": "Registered Dietitian, BSc. (Hons) MSc. (Hons)",
            "bio": "Nutrition Means Business comprises Hilary Du Cane, a dietitian and nutritionist with masses of business and marketing experience. As you can see from the company name, Hilary specialises is turning nutrition into competitive advantage, as well as providing a health check-up in the workplace or in her drive at home in Maidenhead.\n View Details for Hilary Du Cane"
        },
        {
            "name": "Aisling Pigott",
            "title": "BsC Human Nutrition and Dietetics, PgCert Sports Nutrition, MsC Advanced Dietetic Practice, RCBC First into Research",
            "bio": "Nutritional Support, Irritable bowel syndrome including FOD MAP\nWomen's health including pregnancy, breast, feeding and menopause\nMen's Health\nLifestyle advice and meal plans\nCOPD\nHeart Health and cholesterol reduction\nOsteoporosis\n View Details for Rosemary Bonney"
        },
        {
            "name": "Sue Baic",
            "title": "MSc RD MBDA",
            "bio": "Offering services to individuals, groups, and businesses, promoting a nutrient dense diet,within the framework of mindful eating.\n View Details for Gillian Larcombe",
            "url": "https://www.facebook.com/thepracticalkitchen/"
        },
        {
            "name": "Liz Fleming",
            "title": "BSc Hons Nutrition and Dietetics",
            "bio": "Online Dietitian | Intuitive Eating & Weight-Inclusive Nutrition\n View Details for Jessica Rann",
            "url": "https://www.facebook.com/jessrannnutrition/"
        },
        {
            "name": "Sejal Jacob",
            "title": "M.Sc (Dietetics)",
            "bio": "Oxford Gastro Dietitians was set up in order to support adults with the management of their Gastrointestinal symptoms through dietary manipulation.   Specialist areas include a range of upper and lower Gastro intestinal conditions including; Inflammatory Bowel Disease (IBD), Irritable Bowel Syndrome (IBS), Reflux, Gastroparesis, Coeliac Disease, Bowel Motility Disorders, …\n\nCatherine Nash\nRead More »\n\n\nView Details for Catherine Nash"
        },
        {
            "name": "Rosa Holt",
            "title": "BSc (Honours) Nutrition and Dietetics",
            "bio": "Paediatric and Adolescent Dietitian\n25 years of Specialist paediatric experience\n View Details for Jo Price"
        },
        {
            "name": "David Simms",
            "title": "MSc, BSc (Honours), AKC, RD",
            "bio": "Paediatric Dietitian\n View Details for Lucy Jackman"
        },
        {
            "name": "Jessica Rann",
            "title": "BSc (Honours) RD",
            "bio": "Paediatric Dietitian\n View Details for Lucy Jackman"
        },
        {
            "name": "Emma Biddle",
            "title": "Nutrition and Dietetics (Hons) BSc",
            "bio": "Passionate and results-driven dietitian and marketer, with 17 years experience in the NHS and healthcare industry. With extensive dietetic expertise, and marketing skills covering all areas of the mix, Rachel offers a unique set of skills, exceptionally qualified to translate complex scientific data into clear and compelling content, driving the end user to take action. That is, after all, critical to the success of any marketing campaign, whether it be for a corporate, public health or charitable cause. If you’re looking for a nutrition expert to get the right message across to the right audience in the most compelling way, you've come to the right place...\n View Details for Rachel Redman"
        },
        {
            "name": "Kattya Mayre-Chilton",
            "title": "B. Sc. Human Nutrition & Dietetics, RD DT25287",
            "bio": "patients having surgery abroad or having complex problems post weight loss surgery. I am a dietitian passionate about empowering patients to make lasting changes to improve their health, vitality, and quality of life. \n\nI focus on mindset coaching to empower patients to build a healthy relationship with food and help them transform both physically and mentally, breaking the cycle of negative self-talk. \nI provide nutrition screening for corporate companies and group sessions at HeaI created “The Dietologist” to support Bariatric patients during one of the most significant, and possibly overwhelming times in their life, especially those lth & Well Being events.\n View Details for Vandhana Patel",
            "url": "https://www.facebook.com/TheDietologistuk/"
        },
        {
            "name": "Paola Falcoski",
            "title": "Specialist Eating Disorder / Mental Health and Sport Nutrition Dietitian MSc community health",
            "bio": "Peach Clinical Nutrition is a specialist nutrition & dietetic service based in Hillingdon, North West London and the Thames Valley.\n\nWe take pride in providing safe, up to date, evidence- based nutritional advice tailored to you to improve your health condition or medical diagnosis.\n\nWe are specialists in the low FODMAP diet for irritable bowel syndrome (IBS) and the Counterweight Plus programme for weight loss and remission of type 2 diabetes.\n View Details for James Jackson"
        },
        {
            "name": "Louise Bula",
            "title": "BSc (Hons), PgDip, RD",
            "bio": "PhD and RD with a specialist interest in cardiovascular disease, type 2 diabetes, non-alcoholic fatty liver disease and plant-based nutrition.\n View Details for Nicola Guess"
        },
        {
            "name": "Vanessa McMinn",
            "title": "BSc(Hons) Human & Dietetics",
            "bio": "Preet is a dietitian who is passionate about nutrition and health. She has over 10 years experience working within the NHS and academia. During her time with the NHS she worked in a wide array of specialties from diabetes, weight management and nutrition support to name a few. Preet focuses …\n\nPreetpal Kainth\nRead More »\n\n\nView Details for Preetpal Kainth"
        },
        {
            "name": "Judith Calvin",
            "title": "Bsc Hons Nutrition and Dietetics",
            "bio": "Private Dietitian Nutritionist in Brighton, Hove and Liverpool - helping you to be more confident in your food choices with expert nutrition advice that's tailored to you.\n View Details for Jessica English",
            "url": "https://www.facebook.com/levelupnutritionuk"
        },
        {
            "name": "Alex Ballard",
            "title": "BSc Hons RD",
            "bio": "Private practice diabetes specialist dietitian. Experienced speaker and educator for group teaching sessions on topics relating to diabetes, nutrition, health and mental well-being.\n View Details for Nicola K Clarke",
            "url": "https://facebook.com/nkcnutritionuk"
        },
        {
            "name": "Harriet Smith",
            "title": "BSc (Hons) RD",
            "bio": "Private Registered Dietitian working in and around East Kilbride area\n View Details for Karen MacDonald",
            "url": "https://www.facebook.com/Nouryshyoga/"
        },
        {
            "name": "Lisa Waddell",
            "title": "BSc (Hons) Nutr, RD, PhD, MBDA",
            "bio": "Priya is an experienced dietitian in the freelance world. Best known as the dietitian on BBC 1's Eat Well for Less. Her no nonsense, common sense and down to earth approach is approachable and evidenced based.\n View Details for Priya Tew",
            "url": "https://www.facebook.com/PriyaTewDietitianUK/"
        },
        {
            "name": "Mandel Annika",
            "title": "BSc (Hons) in Nutrition and Dietetics (First class)",
            "bio": "Rachel is a Personalised Nutrition Specialist Dietitian on Harley Street, registered with the British Dietetic Association (BDA) and Health Care Professionals Council (HCPC). She undertook a Masters of Science (MSc) degree at King's College London and complimented her clinical training at St Thomas's, The Royal Marsden and Imperial College trust. Rachel is an expert in Nutrigenomics, weight-loss and digestive problems such as irritable bowel syndrome (IBS).\n View Details for Rachel Clarkson",
            "url": "https://www.facebook.com/thednadietitian/?modal=admin_todo_tour"
        },
        {
            "name": "Cathy Redman",
            "title": "BSc Dietetics, SOS approach to feeding children.",
            "bio": "Rachel is available to work with individual athletes and sports teams, virtually or in-person dependent on location. Specialising in Sports and Performance Nutrition. Her approach is holistic, bespoke and sustainable.\n View Details for Rachel Stentiford"
        },
        {
            "name": "Lorraine McCreary",
            "title": "BSc Nutrition and Dietetics",
            "bio": "Rebecca is a HCPC Registered Dietitian with a wealth of experience in helping clients manage health conditions through dietary change. Since Rebecca has worked for 10 years in the most multi-cultural area of the UK, she has a real understanding of how our relationship with food may differ according to …\n\nRebecca McManamon\nRead More »\n\n\nView Details for Rebecca McManamon"
        },
        {
            "name": "Claire Fenlon",
            "title": "Bsc Hons Nutrition and Dietetics (first class)",
            "bio": "Registered dietitian (freelance) Elizabeth Campling can check through your diet, address your nutritional concerns, and provide guidance about what and how to make appropriate dietary and other lifestyle changes.\n View Details for Elizabeth Campling",
            "url": "https://www.facebook.com/eat.health.ecampling"
        },
        {
            "name": "Sue Dawe",
            "title": "BSc(Hons), RD",
            "bio": "Registered Dietitian and Nutrition Researcher\n View Details for Tai Ibitoye"
        },
        {
            "name": "Sian Shepherd",
            "title": "BSc (Honours) Nutrition, Registered Dietitian, Further Education Teacher's Certificate",
            "bio": "Registered Dietitian in the North East of England \n5 years NHS experience in various specialities\n View Details for Nicole Lackenby"
        },
        {
            "name": "Barry Cullen",
            "title": "PG Diploma Dietetics",
            "bio": "Rochez is the lead dietitian at the 100 % digital private practice, Savour Nutrition, with more than 10 years of experience. \nShe is the founder of two successful private practices. \n\nShe specialises in personalised nutrition, treating YOU as an individual. Her passion lies in finding root causes, using tools like gene based personalised nutrition (DNA testing), optimising GUT health. weight management, plant-based eating (vegan/vegetarian) and changing behaviour through mindful eating principles. \n\nShe has written for nutrition publications, regularly attends health conferences, adding the most up to date science-based nutrition methodology to the practice.\n\nOn the corporate side, Rochez has years of experience developing programmes to improve workplace wellness, nutritional consulting for food companies.\n View Details for Rochez O’Grady",
            "url": "https://www.facebook.com/savournut/"
        },
        {
            "name": "Nicola Guess",
            "title": "RD MPH PhD",
            "bio": "Ruth Kander is a knowledgeable, kind and caring dietitian who wants to help people be the best they can be. Ruth has a passion to provide people with reliable information that is practical to follow their help their individual needs.\n View Details for Ruth Kander",
            "url": "https://www.facebook.com/yourdietmatters/"
        },
        {
            "name": "Karen Jones",
            "title": "BSc (Honors) nutrition and dietetics, Registered dietitian",
            "bio": "Ruth qualified in 1994 from the University of Surrey with a BSc Hons in Human Nutrition and Dietetics following her training at University College/Middlesex Hospital, London. She has a wide range of experience in adult dietetics and worked as the Lead Specialist Oncology Dietitian for 11 years at Mount Vernon Cancer Centre, Northwood. She has extensive oncology and nutritional support experience – she has been seeing and supporting cancer patients for many years.\nSince 2011 after specialist training she has started using a low FODMAP approach in treating IBS.  Ruth maintains up to date practice through professional activities such as regular workshops, short courses and meetings.\nRuth strives to provide excellent standards of dietetic care and improve patient outcomes.\nRuth has expertise in a range of conditions, including:\nCancer and palliative care\nGastrointestinal (Digestive) conditions e.g IBS, Coeliac Disease\nDifficulties in gaining weight/experiencing unintended weight loss,\n View Details for Ruth Conroy"
        },
        {
            "name": "Dalia Maori",
            "title": "BSc Hons, RD (USA CDR and UK HCPC)",
            "bio": "RW dietetics specialises in Paediatric Nutrition, with expertise in food allergy and gastrointestinal conditions i.e. infant feeding/reflux/Coeliacs/IBS/ Fodmaps.\n View Details for Rachel Wood"
        },
        {
            "name": "Komal Deepak Kumar",
            "title": "MSc, RD Fertility Specialist Dietitian",
            "bio": "Sadia Latimer is an experienced gastroenterology dietitian registered with the Health Care Professional Council and a member of the British Dietetic Association (BDA). She has fifteen years of postgraduate experience in the National Health Service (NHS) across a wide variety of clinical settings, specialising in digestive health conditions in 2010. …\n\nSadia Latimer\nRead More »\n\n\nView Details for Sadia Latimer"
        },
        {
            "name": "Jennifer Ryan",
            "title": "PGDip MSc Dietetics",
            "bio": "Samantha is an experienced Dietitian and co-founder of Sunlight Nutrition Limited. She graduated from the University of Nottingham in 2007 with a Master of Nutrition Degree. Samantha spent 10 years working in the NHS in a variety of clinical roles including gastroenterology, nutrition support, food allergy and more latterly in …\n\nSamantha Howard\nRead More »\n\n\nView Details for Samantha Howard",
            "url": "https://www.facebook.com/SunlightNutritionLtd/"
        },
        {
            "name": "Samantha Howard",
            "title": "Master of Nutrition",
            "bio": "Sandeepa is a HCPC registered Dietitian with over 16 years’ experience working in the NHS providing clients with tailored nutrition advice.   \nSandeepa is FODMAP trained and her main specialist areas are gut health, coeliac disease, irritable bowel syndrome, inflammatory bowel disease and nutrition in cancer. She is passionate about nutrition & well-being and also enjoys helping clients needing advice on women’s health, diabetes, heart health, weight management and nutrition in pregnancy.  \n View Details for Sandeepa Soni",
            "url": "https://www.facebook.com/search/top?q=NutritionwithSandy"
        },
        {
            "name": "Victoria Hilton",
            "title": "BSc (Honors) RD",
            "bio": "Sarah is a Registered Dietitian with the HCPC. She began her studies at Leeds University in 2006 studying Food Studies and Nutrition. She followed her interest in the area of human nutrition and completed a post graduate Degree at Leeds Beckett University in Nutrition and Dietetics and converted this into …\n\nSarah Elder\nRead More »\n\n\nView Details for Sarah Elder"
        },
        {
            "name": "Emily Sutton",
            "title": "Master of Nutrition",
            "bio": "Sarah Roberts : Professional Dietitian Specialising in Mental health , Eating Disorders including ARFID , Autism ,Sensory processing and feeding difficulties in Children and Adults\n View Details for Sarah Roberts"
        },
        {
            "name": "Hayley Fowler",
            "title": "PG Dip Dietetics",
            "bio": "Sejal Jacob is a registered dietitian with Masters degree in Dietetics.She works within the NHS trust and also has a private practise.Sejal has nearly 10years of  experience and in-depth knowledge in various aspects of nutrition and diet both in adults and paediatrics. She is trained in low fodmap diet from …\n\nSejal Jacob\nRead More »\n\n\nView Details for Sejal Jacob"
        },
        {
            "name": "Sema Jethwa",
            "title": "BSc (Hons) Nutrition and Dietetics",
            "bio": "Sheri works exclusively with adults in the community who have had a life-changing injury such as: – brain injury/cerebral palsy – spinal cord injury – amputation or complex orthopaedic trauma Clients are usually referred to Specialist Nutrition Rehab via their case manager or solicitor.  Clients are most commonly referred …\n\nSheri Taylor\nRead More »\n\n\nView Details for Sheri Taylor"
        },
        {
            "name": "Nicola K Clarke",
            "title": "BSc (Hons) Registered Dietitian",
            "bio": "Sheri works exclusively with adults in the community who have had a life-changing injury such as: – brain injury/cerebral palsy – spinal cord injury – amputation or complex orthopaedic trauma Clients are usually referred to Specialist Nutrition Rehab via their case manager or solicitor.  Clients are most commonly referred …\n\nSheri Taylor\nRead More »\n\n\nView Details for Sheri Taylor"
        },
        {
            "name": "Mabel Blades",
            "title": "PhD, RD, MPhil, MBA, BSc hons, MIFST,",
            "bio": "Sian completed her MSc in Nutrition & Dietetics in 2007. Since then, she has worked in the NHS and become a busy mum to 3 little ones. Founder of The Internet Dietitian.com and co founder of Red Pepper Nutrition LLP, she is experienced in working with a range of diets …\n\nSian Riley\nRead More »\n\n\nView Details for Sian Riley"
        },
        {
            "name": "Barira Saad",
            "title": "BS (Hons.), PGD in Dietetics, M.Phil, RD",
            "bio": "Sian is a HCPC Registered Consultant Dietitian with practising privileges at BMI The Cavell Hospital and BMI The Kings Oak Hospital in North London. She has an extensive NHS portfolio which ensures exemplary evidence-based clinical practice and consistent professional development. She now works primarily in the NHS on behalf of …\n\nSian Shepherd\nRead More »\n\n\nView Details for Sian Shepherd"
        },
        {
            "name": "Clare Grace",
            "title": "RD, MSc, PhD",
            "bio": "Since graduating with a BSc (Hons) in Nutrition & Dietetics in 2014, Katie has worked in several NHS trusts in the South East of England, across different clinical specialities including Stroke, Oncology & Critical Care, however her specialist interest is in Gastroenterology. Her experience includes the role of Senior Specialist …\n\nKatie Powell\nRead More »\n\n\nView Details for Katie Powell"
        },
        {
            "name": "Nishti’s Choice",
            "title": "Specialist Dietitian for Children & Parents (RD UK & Denmark)",
            "bio": "Since qualifying as a science teacher and then as a Dietitian in 2013, I aim to create an enjoyable atmosphere to support positive dietary changes.  This could be on an individual basis where I will work with you 1:1 to progress towards your dietary goals, perhaps due to a recent diagnosis or to lose or gain weight.  \nI also work with companies.  If you're an organisation looking to provide tailored dietetic sessions/ideas for your staff, or perhaps pupils or customers, please feel free to get in touch to explore options.\nI ensure a safe, healthy and holistic approach.\n View Details for Samantha Milner",
            "url": "https://www.facebook.com/SMDietetics/"
        },
        {
            "name": "Cherry Hagger",
            "title": "BSc Dietetics (Hons) BA International Hospitality Management (Hons) RD",
            "bio": "Sophie is a UK Registered HCPC Dietitian with clinical  dietetic experience. Sophie works with clients to support them to meet their goals and optimise nutritional well-being through careful assessment and support. Sophie can provide specialist nutritional advice for help with symptom management of disease, side effects of treatment, weight gain …\n\nSophie McFarland\nRead More »\n\n\nView Details for Sophie McFarland"
        },
        {
            "name": "Alejandra Alarcon Navarro",
            "title": "BSc (Hons) Nutrition and Dietetics",
            "bio": "Sophie Medlin is a consultant dietitian and is Chair for The British Dietetic Association for London. Sophie is a leading specialist in the management of bowel conditions such as Crohn's disease, ulcerative colitis, diverticular disease and the nutritional management of colostomies and ileostomies.\n View Details for Sophie Medlin",
            "url": "https://facebook.com/sophiedietitian"
        },
        {
            "name": "Rosemary Bonney",
            "title": "BSc (Honours) Dietetics",
            "bio": "Specialist gastroenterology and surgical dietitian with over 5 years experience\n View Details for Natalie Callue"
        },
        {
            "name": "Caroline Laidlaw",
            "title": "BSc (Hons) Nutrition, Post Graduate Diploma Dietetics",
            "bio": "Specialist Paediatric & Maternal (Pregnancy) Dietitian and BDA Media spokesperson.\n View Details for Hannah Whittaker",
            "url": "https://www.facebook.com/Bump2baby-Nutrition-106319588280402"
        },
        {
            "name": "Jo Rayner",
            "title": "BSc (Hons) RD",
            "bio": "Susan has over 20 years experience and specialises in weight loss, plant based nutrition and gut disorders. Other areas include corporate wellness and personalised nutrition.\n View Details for Susan Burry",
            "url": "https://www.facebook.com/nutritionuuk/"
        },
        {
            "name": "Michelle Bremang",
            "title": "Msc Dietetics (Merit), Bsc (Hons) Nutrition",
            "bio": "Tazmin Lewis is specialist Registered Dietitian situated in the diverse population of North West London. Having grown up in this area she is familiar with the local population and the diets of different cultures. She enjoys getting to know her clients and working towards their goals together. Tazmin has experience …\n\nTazmin Lewis\nRead More »\n\n\nView Details for Tazmin Lewis"
        },
        {
            "name": "Ian Thomas",
            "title": "BSc *Hon) Nutrition and Dietetics",
            "bio": "Television and radio appearances, regularly published in the UK press BBC Good Food Writer Spokesperson for the British Dietetic Association IBS Emer is fully trained in the low FODMAP approach and will help you ease your painful symptoms. Her recent cook book ‘IBS? Recipes For Success’ is full of delicious …\n\nEmer Delaney\nRead More »\n\n\nView Details for Emer Delaney",
            "url": "http://www.facebook.com/myprivatedietpage/"
        },
        {
            "name": "Carin Hume",
            "title": "BSc Dietetics, MSc Sports Nutrition",
            "bio": "Thank you for selecting my profile. I am a registered children’s dietitian with over 20 years’ clinical experience in the NHS, and with particular expertise in food allergies and gastrointestinal conditions such as irritable bowel syndrome and inflammatory bowel disease. I have a BSc Honours degree in Nutrition and Dietetics …\n\nJoan Gavin\nRead More »\n\n\nView Details for Joan Gavin",
            "url": "https://www.facebook.com/dietitian4kids"
        },
        {
            "name": "kate costello",
            "title": "Bsc (Hons) Nutrition and Dietetics",
            "bio": "The Dietitian's Room is an evidence based consultancy and provides the  most current and up to date information and research  to clients. Whether your company requires research for a particular project or you need an expert opinion/report please feel free to contact me.\n View Details for Dahlia Kulkarni"
        },
        {
            "name": "Brenda Smith",
            "title": "RD BS (Hons) PGDip (Allergy) Mindful Eating Instructor",
            "bio": "The driving force for setting up Cherry Nutrition was a deep desire to help improve people's lives by giving them insight into their health conditions and empowering them to make positive change. My passion is helping people to improve their gut health with conditions such as; IBS (FODMAP trained), acid reflux, coeliac, chronic constipation, issues post gallbladder removal, diverticular disease, chronic diarrhoea, & other gastroenterology conditions (see Cherry Nutrition).\n View Details for Cherry Hagger",
            "url": "https://www.facebook.com/happygutdietitian/?modal=admin_todo_tour"
        },
        {
            "name": "Laura Tilt",
            "title": "PG Diploma Human Nutrition and Dietetics, Registered Dietitian, MSc Public Health Nutrition",
            "bio": "The Hereford Dietitian offers clinics in rural Herefordshire. It is run by  Alice Johnson, an experienced Dietitian with over 10 years experience working in the NHS. Alice has a specialist interest in helping people to lose weight. \nPlease get in contact to discuss your requirements and to see how Alice might be able to help you lose weight in a safe and sustainable way or visit The Hereford Dietitian website for further details about the weight management programmes which are on offer.\n View Details for Alice Johnson",
            "url": "https://www.facebook.com/thehereforddietitian/"
        },
        {
            "name": "Mei Wan",
            "title": "BSc Honors RD MBDA",
            "bio": "THE LONDON DIABETES DIETITIAN\n\nYour health is important so make it your top priority! \n\n​The London Diabetes Dietitian can help you to prevent or manage your diabetes and its associated complications. \n\n✔​ We provide professional, high-quality specialist dietetic services which are easily accessible via face to face, telephone or Skype consultations.\n\n✔ We create tailored dietary and lifestyle plans which are designed to meet your individual needs. \n\n✔ Our dietary information resources are peer-reviewed, patient tested and contain consist nutritional messages.  \n\n✔ Our services are based on the most up to date research and evidence-based guidelines.\n\n✔ We offer additional dietetic services for a variety of conditions.\n\n✔ We work with medical insurance providers.\n\n​The London Diabetes Dietitian works with you to develop your knowledge, skills and confidence to make effective dietary and lifestyle changes to achieve your health goals!\n View Details for Chanda Pattni"
        },
        {
            "name": "Jasmine Carbon",
            "title": "BSc (Hons) Nutrition and Dietetics",
            "bio": "This is where your journey to OPTIMUM HEALTH starts!! Whether it is symptom relief, weight loss, help with identifying food intolerances or you are looking to achieve optimum health. You will get expert advice and support from a Registered Dietitian. Specialising in Irritable Bowel Syndrome, Small intestinal Bacterial Overgrowth (SIBO) and Food Intolerances. At Digestive Health, we aim to support you through your journey to achieving OPTIMUM health and getting you the BEST results!\n\nI have extensive experience in providing personalised and evidenced based advice to clients with a variety of conditions including:\nCoeliac disease\nIrritable Bowel Syndrome (IBS).\nlow FODMAP diet\nFood intolerances\nWeight management\nBespoke Nutritional Plans: Paleo, Vegan, Vegetarian, Gluten-Free, Wheat/Dairy-Free, Histamine-Free.\nI have completed a specialist training course at King’s College University London, focusing on the specific use of low FODMAP diet to manage & improve IBS symptoms\n View Details for Tamsin Kivi"
        },
        {
            "name": "Gemma Collins",
            "title": "MSc Nutrition, Physical Activity and Public Health, PG Dip Dietetics, BSc (Hons) Consumer Science",
            "bio": "Victoria is both an experienced Dietitian and Personal Trainer and is therefore in a unique position to advise on both diet and exercise. Victoria graduated from King’s College London in 2011 and practiced as a registered Dietitian within the NHS from 2011-2018. Since then she has focused on her private …\n\nVictoria Mann\nRead More »\n\n\nView Details for Victoria Mann",
            "url": "https://www.facebook.com/Oakman"
        },
        {
            "name": "Priya Tew",
            "title": "BSc (Hons), PG Dip, MSc (Diet).",
            "bio": "Vikki has worked as a dietitian in the NHS with a variety of medical conditions during her career such as; diabetes, pulmonary and cardio rehabilitation and nutrition support. More recently she has worked within adult weight management empowering people to get healthy through lifestyle changes. She has a personal interest …\n\nVikki Poole\nRead More »\n\n\nView Details for Vikki Poole",
            "url": "https://www.facebook.com/thenutritionpoole/"
        },
        {
            "name": "Charlotte Finlay",
            "title": "BSc (Hons) RD",
            "bio": "We empower parents to change the way they feed their children’s physical & emotional wellbeing 💚\n View Details for Nishti’s Choice",
            "url": "https://www.facebook.com/Nishtischoice/"
        },
        {
            "name": "Mairi Wilcock",
            "title": "Bsc(hons) RD",
            "bio": "We offer online counselling and coaching services over Skype or telephone with accredited dietitians/ nutritionists only. Whether it is to lose weight, prevent/ treat chronic diseases, improve sports performance or to help you with any other health related concerns our only goal is to make you succeed and get results! \nOur team constantly work at their best to provide you with a unique, outstanding and personalized service.\n\nWe commit to continuous improvement to deliver a service at its highest quality.\n View Details for Karine Patel"
        },
        {
            "name": "Pam Finlay",
            "title": "PgDip Dietetics",
            "bio": "Weight Loss Expert. North West, Preston, Liverpool, Garstang, Lancaster, Blackpool.\n View Details for Paula Day"
        },
        {
            "name": "Yvonne Mitchell",
            "title": "BSc Honors Human Nutrition and Dietetics",
            "bio": "Weight reduction, weight management, weight reducing, diabetes, cardiovascular disease, CVD, pregnancy\n View Details for Charlotte Finlay"
        },
        {
            "name": "Elaine Anderson",
            "title": "BSc (Hons) Dietetics RD",
            "bio": "Welcome to 'My Nourishment, a nutrition service offering personal dietary advice with a registered dietitian, based in Exeter, Devon, as well as via virtual consultations.   I'm Angeline Taylor, founder of My Nourishment, I have over 12 years experience as a practicing dietitian, both privately and within the NHS.  I trained as a Dietitian because of my interest and love of nutrition and it's impact on wellbeing and health.  Being a Dietitian has allowed me to combine my love of working with people, my passion for food and the wonderful science of nutrition and health.  Working in both private practice and as a Specialist NHS Dietitian, I am able advise on several nutritional topics, to include; plant-based diets, healthy eating, weight loss, heart health, diabetes, IBS and digestive health, bone health, hormonal imbalance, mood disorders, and chronic kidney disease.\n View Details for Angeline Taylor"
        },
        {
            "name": "Deborah Norman",
            "title": "BSc (Hons) Nutrition, Registered Dietitian, PG Dip Health Promotion, PG Cert Sports Nutrition",
            "bio": "WELCOME TO HARLEY DIETITIANS NUTRITIONAL CONSULTANCY\nAre you concerned about your child’s nutrition and require advice to fit your child’s individual needs? Or has your child been recently diagnosed with a medical condition that requires specific dietary advice, for example cow’s milk protein allergy/ Crohns disease/ reflux or poor growth/ gastric problems/ coeliac disease/weight management of even advice regarding neonatal nutrition?\nOr are you currently pregnant and seeking advice around your own nutritional needs during pregnancy or have specific medical concerns including gestational diabetes, morning sickness etc.\n View Details for Ghazala Yousuf",
            "url": "http://www.harleydietitians.co.uk/"
        },
        {
            "name": "Hannah Dobson",
            "title": "BSc (Hons) Dietetics and Nutrition",
            "bio": "When it comes to diet………….one size does not fit all!\nI can provide you with a personalised nutrition plan that considers your lifestyle, your fitness/health goals and your food preferences.  Alongside this I can advise on the best dietary changes to treat a recent or existing medical diagnosis, ensuring that you receive an all-encompassing and effective nutrition plan.\n\nMy clinic is based in South West London but can also provide virtual consultations for those further afield.\n View Details for Sharmain Davis",
            "url": "https://www.facebook.com/LondonDietConsultant"
        },
        {
            "name": "Francisco Vallejo Castillo",
            "title": "Registered Dietitian, BSc. (Hons), MSc (Hons)",
            "bio": "Will is a Registered Dietitian specialising in Type 1, Type 2 and Gestational Diabetes; Pre-Diabetes & complex weight management. Will offers simple, tailored and individualised nutritional  therapy to empower YOU to achieve YOUR health goals. Personalised packages are made to develop holistic, achievable and sustainable long-term health changes. Consultation & …\n\nWill Hadfield\nRead More »\n\n\nView Details for Will Hadfield",
            "url": "https://facebook.com/wenutritionuk"
        },
        {
            "name": "Dr Rona Antoni",
            "title": "BSc (Hons) RD, PhD",
            "bio": "With a broad array of nutrition-related business skills, Angie holds a unique position in her ability to advise both commercial and not-for-profit clients on all aspects of their business. \nFrom product R&D to web development, public speaking to bespoke training, whatever the project large or small, clients can trust Angie to deliver nutrition information to fit their needs in a down-to-earth and engaging style.\n View Details for Angie Jefferson"
        },
        {
            "name": "Karen MacDonald",
            "title": "BSc Hons Human Nutrition and Dietetics",
            "bio": "With almost 10 years of NHS experience in clinical dietetics I am able to bring a wealth of experience in medical nutrition (predominantly adult nutrition support and gastroenterology) to private practice on a 1:1 or project basis. My aim is simple - to enable you to access a dietitian in your pocket, when you need to.\n View Details for Sarah Brook"
        },
        {
            "name": "Adriana Garcia Jones",
            "title": "BSc MSc RD",
            "bio": "With over 10 years professional practice as a registered dietitian I help people navigate their relationship with food and their journey towards optimal health. I have worked in both the pubic and private sector with clients from all walks and stages of life, from diverse cultural backgrounds and with various health conditions. From my experience food and health is universal, yet what works for any one of us can be unique to every one of us. Getting this right and sustaining it, making lasting positive change, is not just a matter of a good diet plan.\n\nThrough my training in functional medicine, I work with my clients to address the root cause of their health symptoms. I address areas such as Diabetes and blood sugar disorders, heart disease, cholesterol, thyroid conditions, circadian rhythms, and weight management.\n View Details for Symone Genovezos"
        },
        {
            "name": "Hazel Elliott",
            "title": "BSc (Hons) Dietetics, RD",
            "bio": "Working as a dietitian for over 15 years, Victoria is experienced in translating up-to-date scientific research on nutrition and disease into practical and realistic advice to help you reach your dietary goal. Dietitians are the only nutrition professionals to be regulated by law and governed by an ethical code, to ensure that …\n\nVictoria Francis\nRead More »\n\n\nView Details for Victoria Francis",
            "url": "https://www.facebook.com/VictoriaFrancis.RD"
        },
        {
            "name": "Emily Bloxam",
            "title": "BSc (Hons) RD",
            "bio": "Your goals your pace your personal Dietitian\n View Details for Tabassum Kabeer",
            "url": "https://www.facebook.com/Private-Dietitian-wales-678225695573436/"
        },
        {
            "name": "Isabelle Fry",
            "title": "BSc Nutrition and Dietetics, PG Diploma Dietetics",
            "bio": "Your Greek Dietitian {online}\n View Details for Maria Kolotourou",
            "url": "https://www.facebook.com/YourGreekDietitian"
        },
        {
            "name": "Jo Withers",
            "title": "BSC (Honors) Nutrition Dietitics",
            "bio": "Youth and adult sports performance dietitian and Paediatric dietitian. Jenaed Gonçalves Brodell is a well know Registered Dietitian (HCPC) and  Sport Scientist. She has experience working for the NHS & in the private sector and has a special interest  in working with junior athletes as well as adult athletes specialising in sports performance.  She has experience in the Paediatric field specialising in cows milk protein allergy, picky eating , anaemia, autism and selective eating. \n View Details for Jenaed Brodell"
        }
    ]
}